{
  "id": "14589ba871de4a71a03700560867fce7",
  "namespace": "3c52fbac843d4375803187739db84801",
  "title": "Worlds in Crisis",
  "description": "In Worlds in Crisis, you will encounter a host of new world events with ideological choices that you will have to resolve. Several new planet types and well over a dozen new planet features also await you.",
  "longDescription": "# About this DLC\n\nEvery world has a story, and it’s up to you to decide how it ends.\n\nIn Worlds in Crisis, you will encounter a host of new world events with ideological choices that you will have to resolve. Several new planet types and over a dozen new planet features also await you, breathing new life into the game for old-time Galactic Civilizations players while offering exciting options for people picking up the game for the first time.\n\n# New Planetary Crises\n\nRuling a galaxy is tough work, full of perilous and precarious decisions that must be made on a regular basis. As you explore and expand, you may encounter worlds struggling with crises from planetary mutations, to raging pandemics, to murderers on the loose, and much more.\nSome of the troubles you might encounter are:\n\n- Native intelligent primates - We’re not monkeying around here. A newly terraformed continent reveals quite a surprise.\n\n- Mad Governor - Just what is going on here? Mass hallucinations, city-wide parties, and people disappearing off the streets make for an unusual adventure.\n\n- Notorious Smugglers - Will this smuggler have a change of heart, or go back to his old ways? That’s entirely up to you.\n\n- And more! - A host of new choices await you. Will you handle them benevolently, pragmatically, or malevolently?\n\n# New Planet Types\n\nExplore worlds sterilized by mad scientists, landscapes littered with ancient battlefields, and tranquil planets overflowing with milk, honey - and whatever that blue stuff is that the Altarians drink.\n\n- Sterile World: This planet isn’t meant for housing life, but it’s perfect for running certain “controlled” experiments…\n\n- Fertile World: Abundant with life and foliage, it’s the perfect planet for feeding an entire empire.\n\n- Tranquil World: Beautiful and serene, this place is just waiting to be overrun by retirees.\n\n- Volcanic World: Abundant power is nice, but boy do the earthquakes get old.\n\n- Fissured World: Deep and abundant fissures may hide secrets within the planet’s core. Dive deep and uncover them.\n\n- Bombarded World: Boiling calderas and abundant geothermal energy are all that remain here after the Precursors’ ancient wars.\n\n# New Planet Features\n\nNew islands, continents, and landmasses leave you with more options as you explore and colonize planets. You’ll enjoy beautiful shorelines, vibrant color, and careful detail on each planet that you visit. There are also several new worlds to explore which offer new and exciting bonuses for those brave enough to colonize them.\n\nSome of the new planet features you’ll find in Worlds in Crisis are:\n\n- Volcanic Rifts- If you can’t handle the heat, then get off the planet! Mine below the surface to extract heat to use in power production.\n\n- Thriving Reef- Dive into a world of abundant reefs and wide oceans. Truly a magical sight to behold.\n\n- Floating Mountains- Mountains in the sky - well, that’s new. Studying this bizarre land feature could bolster your research.\n\n- Permanent Rainbow- We’ve finally found the rainbow connection! The beauty of this world improves the mood of the local populace.\n\n- Giant Mushrooms- Exploring this world should be fun...gi. These freakishly large mushrooms present a generous food source.\n\n- Gold Fields- It’s so shiny! Fields on this world are rich with precious gold.\n\n- And more - It’s a vast galaxy. Over a dozen other planetary types are out there, so start exploring!",
  "status": "ACTIVE",
  "productSlug": null,
  "urlSlug": "galactic-civilizations-iii--worlds-in-crisis",
  "creationDate": "2020-12-09T08:18:06.947Z",
  "lastModifiedDate": "2021-01-24T22:34:15.801Z",
  "effectiveDate": "2021-01-21T16:00:00.000Z",
  "viewableDate": null,
  "developer": null,
  "seller": {
    "id": "o-l69v3ppj5zgdpwtuvq6sgjew5yjt5w",
    "name": "Stardock Entertainment, Inc"
  },
  "linkedOfferId": null,
  "isFeatured": false,
  "ignoreOrder": false,
  "freeDays": 0,
  "collectionOfferIds": [],
  "technicalDetails": null,
  "recurrence": "ONCE",
  "categories": [
    {
      "path": "addons"
    },
    {
      "path": "addons/durable"
    },
    {
      "path": "applications"
    }
  ],
  "tags": [
    {
      "id": "9547",
      "name": "Windows",
      "namespace": "epic",
      "aliases": [],
      "operator": null,
      "created": "2019-10-11T02:43:18.435Z",
      "updated": "2022-07-29T19:15:41.062Z",
      "status": "ACTIVE",
      "referenceCount": 11376,
      "comment": null
    }
  ],
  "customAttributes": [
    {
      "key": "publisherName",
      "value": "Stardock Entertainment"
    },
    {
      "key": "developerName",
      "value": "Stardock Entertainment"
    }
  ],
  "keyImages": [
    {
      "type": "OfferImageWide",
      "url": "https://cdn1.epicgames.com/3c52fbac843d4375803187739db84801/offer/crisis wide-2560x1440-52f2ce437283fbb163b10d30b184d9ef.jpeg",
      "md5": "52f2ce437283fbb163b10d30b184d9ef",
      "size": 961808,
      "uploadedDate": "2021-01-04T22:14:18.616Z",
      "width": 2560,
      "height": 1440
    },
    {
      "type": "OfferImageTall",
      "url": "https://cdn1.epicgames.com/3c52fbac843d4375803187739db84801/offer/crisis tall-1200x1600-019711170372ad3c4c9774e2a3b8872b.jpeg",
      "md5": "019711170372ad3c4c9774e2a3b8872b",
      "size": 562909,
      "uploadedDate": "2021-01-04T22:14:30.519Z",
      "width": 1200,
      "height": 1600
    },
    {
      "type": "Thumbnail",
      "url": "https://cdn1.epicgames.com/3c52fbac843d4375803187739db84801/offer/crisis tall-1200x1600-019711170372ad3c4c9774e2a3b8872b.jpeg",
      "md5": "019711170372ad3c4c9774e2a3b8872b",
      "size": 562909,
      "uploadedDate": "2021-01-04T22:14:43.016Z",
      "width": 1200,
      "height": 1600
    },
    {
      "type": "CodeRedemption_340x440",
      "url": "https://cdn1.epicgames.com/3c52fbac843d4375803187739db84801/offer/crisis tall-1200x1600-019711170372ad3c4c9774e2a3b8872b.jpeg",
      "md5": "019711170372ad3c4c9774e2a3b8872b",
      "size": 562909,
      "uploadedDate": "2021-01-04T22:15:50.150Z",
      "width": 1200,
      "height": 1600
    },
    {
      "type": "DieselStoreFrontWide",
      "url": "https://cdn1.epicgames.com/3c52fbac843d4375803187739db84801/offer/crisis wide-2560x1440-52f2ce437283fbb163b10d30b184d9ef.jpeg",
      "md5": "52f2ce437283fbb163b10d30b184d9ef",
      "size": 961808,
      "uploadedDate": "2021-01-04T22:16:04.042Z",
      "width": 2560,
      "height": 1440
    },
    {
      "type": "DieselStoreFrontTall",
      "url": "https://cdn1.epicgames.com/3c52fbac843d4375803187739db84801/offer/crisis tall-1200x1600-019711170372ad3c4c9774e2a3b8872b.jpeg",
      "md5": "019711170372ad3c4c9774e2a3b8872b",
      "size": 562909,
      "uploadedDate": "2021-01-04T22:16:15.585Z",
      "width": 1200,
      "height": 1600
    }
  ],
  "items": [
    {
      "id": "8d5774114b6b45b7acb95a9ef327ddd0"
    }
  ],
  "catalogNs": {
    "name": "3c52fbac843d4375803187739db84801"
  }
}