{
  "id": "3121d75591e74dfcbeb95c6fa10d9874",
  "namespace": "e54d691e36d44ba88e2be4b2e4c16535",
  "title": "PROJECT_ORIGINS",
  "description": "PROJECT_ORIGINS is an Action RPG video game. Explore a fantastic world in a variety of different ways, such as fishing, crafting, harvesting, smithing, and more. Players can tame animals, find mounts, and interact with a valuable wealth of audio knowledge in real time.",
  "longDescription": "<!--textBlock-->\n<!--title-->\n# PROJECT_ORIGINS is an Action RPG; tame animals, find mounts, explore, and interact with a valuable wealth of audio knowledge in real time.\n<!--text-->\nPROJECT_ORIGINS is an Action RPG video game By Together Again Gaming. Players can tame animals, find mounts, explore the world, and interact with a valuable wealth of audio knowledge in real time.\n\nPurchasing grants the owner bleeding edge early access to our demonstration file. As the game progresses the price will increase.\n\n<!--textBlock-->\n<!--title-->\n# Systems And Features\n<!--text-->\nHere is a list of the systems and features you can access and use while playing PROJECT_ORIGINS:\n\nCharacter Creation: When you start the game, you get to create your character by choosing a Race and Gender. You also select a Class, which determines your starting stats and the items you begin with. The visual appearance you see in the character selection screen is based on your chosen race and gender.\n\nStats & Attributes: Your character has various stats like Health, Mana, and Strength. These start based on your class but can also increase by equipping items (weapons, armor, etc.) or gaining certain passive skills. You can view all your current attributes, seeing your base stats and the bonuses from your equipped gear. Some stats, like attack power, have a minimum and maximum value that affects gameplay.\n\nInventory: You manage all the items you collect in your inventory. The inventory can feel like a puzzle where items take up different shaped blocks (Jigsaw style) or be a simple list. Items are organized into categories like weapons, armor, and crafting materials. Collecting and equipping multiple items from a specific Item Set can give you extra bonus stats.\n\nPicking Up Items: You can pick up items that you find laying on the ground in the world. You can see the item visually represented on the ground before you pick it up. Sometimes, multiple copies of the same item might be stacked together.\n\nLoot Containers: You can open Loot Containers, which are objects placed in the world, to find and take the items stored inside them.\n\nEquipment: You can equip items like weapons, shields, armor pieces (like gloves), necklaces, and other gear. Equipment fits into specific slots on your character. Items might have restrictions, meaning only certain classes, races, or genders can equip them, or they might be restricted to being one-handed or two-handed. When you equip an item, its visual model appears on your character.\n\nEquipment Mods: Some equipped items have special mod slots. You can add other specific items (like gems) into these slots to gain additional benefits, most often extra stats.\n\nSkills & Abilities: You use Active Skills to perform actions and benefit from Passive Skills that enhance your abilities or stats.\n\nActive Skills: These are the actions you perform, such as attacking, casting spells, using buffs on allies, or debuffs on enemies. Using an active skill might cost Mana and have a cooldown before you can use it again. Some skills require you to target an enemy or ally or might require you to stop moving before you can use them. Active skills can often be leveled up, gaining additional bonuses like increased damage or new effects. Simple active skills might just restore your health or mana or remove negative effects without needing a complex visual effect or action.\n\nPassive Skills: These skills provide constant benefits or enhance your active skills. They can increase your damage, make effects last longer, add new effects to your attacks (like fire damage, poison, stun, or movement slow/boost), or simply add stats directly to your character. Passive skills are often linked to specific active skills in your Skill Tree. Some passive skills have a chance to activate.\n\nUtility Skills: These are types of active skills used for non-combat purposes, like summoning a mount or a friendly unit.\n\nSkill Tree: You have a Skill Tree where you can spend points you earn to unlock and activate new active and passive skills. Skills are connected in the tree, and you usually need to unlock a 'parent' skill before you can unlock the 'child' skills linked to it. Some skills might require you to reach a certain player level before you can unlock them. Some skills in the tree might start as already active without needing points.\n\nAction Bar: You can place your active and utility skills onto an action bar at the bottom of the screen for quick access during gameplay. Some skills may automatically appear in your action bar by default.\n\nCombat: As an Action RPG, a major part of the game is combat. You will deal damage to enemies and receive damage from them. Your skills can apply various effects to targets, such as causing them to bleed or be poisoned over time, slowing down their movement, stunning them, or applying helpful buffs to yourself or allies. Having high resistance stats can help reduce the impact of damage or negative effects. The game helps ensure your offensive skills primarily target enemies. Enemies (AI characters) also engage in combat, using their own skills and having stats.\n\nHealing, Buffs, & Debuffs: You can use certain skills or consumable items (like potions) to restore lost Health or Mana. Some skills apply buffs (positive effects) to yourself or allies, like increasing your stats or movement speed. Enemies can apply debuffs (negative effects) to you, such as damage over time, slow, or stun. Certain skills can cleanse or remove these negative effects. Some skills can even be used while you are stunned.\n\nQuests: You can take on Quests, which may involve talking to characters through dialogues and completing objectives. Quests can reward you with various items and sometimes even skills.\n\nHarvesting: You can gather resources like materials from special objects found in the world. These objects might require you to simply interact with them (they might disappear or stay after interaction), or some might require you to attack them repeatedly until their health is gone. Harvestable objects can reappear after some time. Some might require you to have a specific item, like a tool, in your inventory before you can gather from them.\n\nCrafting: You can craft new items using recipes. Recipes list the specific materials you need to collect to create the item. When you craft an item, it might have random stats added to it.\n\nVendors: You can visit vendors in the world to buy items. The price of items is set. Each vendor has a specific list of items they offer for sale. Like crafted items, items you buy from vendors can sometimes come with random stats.\n\nExperience & Leveling: You gain Experience Points (XP), usually by defeating hostile AI characters. When you accumulate enough XP, you will Level Up your character. The amount of XP required increases as you gain levels. Leveling up may potentially allow you to unlock more skills.\n\n\nAI (Artificial Intelligence): You will interact with other characters controlled by the game's AI. These can be hostile (enemies that attack you), friendly (allies who might help you), or neutral. \n\nAI characters have their own stats and distinct behaviors (like being aggressive and charging at you, or defensive and trying to keep distance). They use skills to attack and can sometimes be stunned. \n\nHostile AI typically patrols around a designated area. Defeating hostile AI rewards you with XP. The AI's attitude towards you (whether they are friendly or hostile) can be affected by things like your faction or guild membership.\n**\n### Each player is equipped with a version of a personal voice assistant. This ai agent can be accessed by pressing and holding the letter \"V\" and asking a question verbally through the player's microphone and then releasing the letter \"V\". The agent then responds verbally through the player's speakers.**\n\nGroups (Parties, Guilds, Factions): You can team up with other players by forming a Party. You can also join or create Guilds, or belong to a Faction. The game can allow combat between players from different factions (Faction PVP) or different guilds (Guild PVP) if those features are enabled. You can typically invite other players to your party, guild, or faction by right-clicking on their character.\n\nMovement: You control how your character moves around the game world. The game supports controlling your character from a Third-person view. Your movement speed can be temporarily increased or decreased by certain skills or effects. As mentioned earlier, some skills might require you to stop moving completely before you can use them.\n\nMinimap: You can use a Minimap displayed on your screen to help you navigate the game world. Important objects like resource nodes for harvesting can be shown on the minimap with special icons and names. The minimap uses a static image of the area rather than a live view.\n",
  "status": "ACTIVE",
  "productSlug": null,
  "urlSlug": "f67aa32556d147bcb9d6e3139262dc01",
  "creationDate": "2024-10-30T21:42:12.182Z",
  "lastModifiedDate": "2025-06-26T10:44:38.264Z",
  "effectiveDate": "2025-04-09T21:14:00.000Z",
  "viewableDate": "2025-03-08T20:00:00.000Z",
  "developer": null,
  "seller": {
    "id": "o-qmma4gt4gcavm6r82naf6vzn9tn4zr",
    "name": "Together Again Gaming"
  },
  "linkedOfferId": null,
  "isFeatured": false,
  "ignoreOrder": false,
  "freeDays": 0,
  "collectionOfferIds": [],
  "technicalDetails": null,
  "recurrence": "ONCE",
  "categories": [
    {
      "path": "games"
    },
    {
      "path": "games/edition"
    },
    {
      "path": "games/edition/base"
    }
  ],
  "tags": [
    {
      "id": "29088",
      "name": "Online Multiplayer",
      "namespace": null,
      "aliases": [],
      "operator": null,
      "created": "2023-06-19T16:23:12.748Z",
      "updated": "2025-06-25T08:25:50.995Z",
      "status": "ACTIVE",
      "referenceCount": 2663,
      "comment": ""
    },
    {
      "id": "1367",
      "name": "RPG",
      "namespace": null,
      "aliases": [],
      "operator": null,
      "created": "2019-06-20T12:01:20.701Z",
      "updated": "2025-06-25T02:49:35.631Z",
      "status": "ACTIVE",
      "referenceCount": 2252,
      "comment": null
    },
    {
      "id": "33639",
      "name": "Promotional Content",
      "namespace": null,
      "aliases": [],
      "operator": null,
      "created": "2024-01-30T16:42:20.388Z",
      "updated": "2024-02-05T20:14:29.988Z",
      "status": "ACTIVE",
      "referenceCount": 389,
      "comment": ""
    },
    {
      "id": "1336",
      "name": "Action-Adventure",
      "namespace": null,
      "aliases": [],
      "operator": null,
      "created": "2019-06-20T12:01:05.439Z",
      "updated": "2025-06-25T02:49:34.963Z",
      "status": "ACTIVE",
      "referenceCount": 1228,
      "comment": null
    },
    {
      "id": "1307",
      "name": "Open World",
      "namespace": null,
      "aliases": [],
      "operator": null,
      "created": "2019-06-20T12:00:51.191Z",
      "updated": "2025-06-25T02:49:34.453Z",
      "status": "ACTIVE",
      "referenceCount": 825,
      "comment": null
    },
    {
      "id": "9547",
      "name": "Windows",
      "namespace": null,
      "aliases": [],
      "operator": null,
      "created": "2019-10-11T02:43:18.435Z",
      "updated": "2025-06-25T08:35:20.218Z",
      "status": "ACTIVE",
      "referenceCount": 20046,
      "comment": null
    },
    {
      "id": "1310",
      "name": "EARLY ACCESS",
      "namespace": "epic",
      "aliases": null,
      "operator": null,
      "created": "2019-06-20T12:00:52.671Z",
      "updated": "2023-08-22T22:50:29.701Z",
      "status": "ACTIVE",
      "referenceCount": 250,
      "comment": null
    }
  ],
  "customAttributes": [
    {
      "key": "autoGeneratedPrice",
      "value": "false"
    },
    {
      "key": "isManuallySetViewableDate",
      "value": "true"
    },
    {
      "key": "isPromotionalContentUsed",
      "value": "true"
    },
    {
      "key": "isManuallySetPCReleaseDate",
      "value": "false"
    },
    {
      "key": "isBlockchainUsed",
      "value": "false"
    }
  ],
  "keyImages": [
    {
      "type": "OfferImageWide",
      "url": "https://cdn1.epicgames.com/spt-assets/d736723c491b4714980ee65c6ff9c3bb/project_origins-16zwa.png",
      "md5": "f255883f3dfb4d77f0252a0a116d8039",
      "size": 1711957,
      "uploadedDate": "2025-02-10T14:28:58.744Z",
      "width": 2560,
      "height": 1440
    },
    {
      "type": "OfferImageTall",
      "url": "https://cdn1.epicgames.com/spt-assets/d736723c491b4714980ee65c6ff9c3bb/project_origins-1d3tt.png",
      "md5": "d260ad6551ac90039a6add12764f2aaf",
      "size": 1256408,
      "uploadedDate": "2025-02-10T15:14:11.733Z",
      "width": 1200,
      "height": 1600
    },
    {
      "type": "Thumbnail",
      "url": "https://cdn1.epicgames.com/spt-assets/d736723c491b4714980ee65c6ff9c3bb/project_origins-1d3tt.png",
      "md5": "d260ad6551ac90039a6add12764f2aaf",
      "size": 1256408,
      "uploadedDate": "2025-02-10T15:14:11.733Z",
      "width": 1200,
      "height": 1600
    },
    {
      "type": "featuredMedia",
      "url": "https://cdn1.epicgames.com/spt-assets/d736723c491b4714980ee65c6ff9c3bb/project_origins-neqob.png",
      "md5": "098f6bcd4621d373cade4e832627b4f6",
      "size": 1482828,
      "uploadedDate": "2025-02-10T15:24:21.081Z",
      "width": 1920,
      "height": 1080
    },
    {
      "type": "heroCarouselVideo",
      "url": "com.epicgames.video://d04bfaa4-bed5-4889-b97c-cb25f000c7b3?cover=https%3A%2F%2Fcdn1.epicgames.com%2Fspt-assets%2Fd736723c491b4714980ee65c6ff9c3bb%2Fproject_origins-video-ear4s.png",
      "md5": "comepicgamesvideomd5hashconstant",
      "size": 20888511,
      "uploadedDate": "2025-06-07T16:53:52.037Z",
      "width": 1920,
      "height": 1080
    },
    {
      "type": "heroCarouselVideo",
      "url": "com.epicgames.video://0aa045c7-c6ba-4110-8157-97bdc79a1347?cover=https%3A%2F%2Fcdn1.epicgames.com%2Fspt-assets%2Fd736723c491b4714980ee65c6ff9c3bb%2Fproject_origins-video-1g7f8.png",
      "md5": "comepicgamesvideomd5hashconstant",
      "size": 18060325,
      "uploadedDate": "2025-05-21T16:38:37.784Z",
      "width": 1920,
      "height": 1080
    },
    {
      "type": "heroCarouselVideo",
      "url": "com.epicgames.video://1f64a256-f41c-4a55-a87d-63b5dcc67a86?cover=https%3A%2F%2Fcdn1.epicgames.com%2Fspt-assets%2Fd736723c491b4714980ee65c6ff9c3bb%2Fproject_origins-video-1h6v7.png",
      "md5": "comepicgamesvideomd5hashconstant",
      "size": 22230982,
      "uploadedDate": "2025-06-07T16:54:36.575Z",
      "width": 1920,
      "height": 1080
    },
    {
      "type": "OgImage",
      "url": "https://cdn1.epicgames.com/spt-assets/d736723c491b4714980ee65c6ff9c3bb/project_origins-8voc7.jpg",
      "md5": "098f6bcd4621d373cade4e832627b4f6",
      "size": 193600,
      "uploadedDate": "2025-02-10T15:25:14.603Z",
      "width": 1200,
      "height": 1200
    }
  ],
  "items": [
    {
      "id": "7b856881cca7472c989f4fc48b1bc80c"
    }
  ],
  "catalogNs": {
    "name": "e54d691e36d44ba88e2be4b2e4c16535"
  }
}