{
  "id": "3e4d16ea778c4a9f89cba96e4b91dc56",
  "namespace": "catnip",
  "title": "Borderlands 3: Director's Cut",
  "description": "Borderlands 3 gets even bigger with the Director's Cut add-on content! Test your mettle against the most fearsome of all Varkids, scour the galaxy to solve a string of murders, experience never-before-seen content and insights from the creation of Borderlands 3, and earn rewards",
  "longDescription": "Borderlands 3 gets even bigger with the Director's Cut add-on, featuring a raid boss encounter, additional story missions, behind-the-scenes extras, and three sets of themed collectibles! \n\nTest your mettle against the most fearsome of all Varkids. Her name has long been whispered in blood-soaked legend; now Hemovorous the Invincible has awoken. This colossal raid boss has made her lair on Pandora, and only the fiercest big game hunters have a chance of kicking her chitinous butt in the pursuit of top-tier loot. Better bring some friends to this fight and be ready to get caked in Varkid guts—it's going to get messy!\n\nMeanwhile, Ava is convinced she has a lead on some potentially supernatural slayings and has decided to document her findings in serialized podcast form. Consider yourself her gun-toting co-host as you investigate strange happenings on Pandora, Promethea, Eden-6, and Nekrotafeyo in search of answers (and loot) with the help of some familiar faces.\n\nIn the Director’s Cut, Vault Hunters can scour the galaxy to solve a string of murders, score loot with three new Vault Cards, and enjoy never-before-seen insights into the development of Borderlands 3. You can also peruse Borderlands 3's beginnings, bloopers, and cut content with a compilation of behind-the-scenes selections. And that’s not all! You can also explore a gallery full of concept art, storyboards, lost maps, and footage of Borderlands 3 from throughout its development.\n\nIncluded in the Director’s Cut are three Vault Cards, which are your ticket to upcoming bundles of themed loot! Once the Vault Cards are released, they can be activated and leveled up to unlock a bevy of cosmetics plus some supremely powerful gear. The first Vault Card will debut with the launch of Director's Cut, featuring items that honor some of Borderlands' most beloved fallen heroes. When multiple Vault Cards are available, you'll have the option to select which one you want to be active.\n\nThis content requires Borderlands 3 to play and is included in Season Pass 2. The first of the three Vault Cards included in Director's Cut is now available, with the remaining two scheduled to launch by the end of 2021.\n\nWhat's New\n• Go toe-to-pincer with Hemovorous the Invincible, a gargantuan Varkid raid boss who drops some of the best loot in the game (provided you can actually kill her)\n• Visit new locations on multiple planets to investigate a series of seemingly paranormal murders and help Ava launch her Mysteriouslier podcast\n• Enjoy a collection of behind-the-scenes content from Borderlands 3's development, including concept art, storyboards, clips, and more\n• Work your way through three Vault Cards featuring themed loot and powerful gear! Collect tons of added cosmetics, including new Vault Hunter Heads and Skins, weapon skins and trinkets, lively emotes, ECHO Device skins, and room decorations to display proudly aboard Sanctuary III",
  "status": "ACTIVE",
  "productSlug": null,
  "urlSlug": "borderlands-3--directors-cut",
  "creationDate": "2020-06-15T20:45:47.385Z",
  "lastModifiedDate": "2021-04-08T16:59:51.153Z",
  "effectiveDate": "2021-04-08T17:00:00.000Z",
  "viewableDate": null,
  "developer": null,
  "seller": {
    "id": "o-37m6jbj5wcvrcvm4wusv7nazdfvbjk",
    "name": "2K Games, Inc."
  },
  "linkedOfferId": null,
  "isFeatured": false,
  "ignoreOrder": false,
  "freeDays": 0,
  "collectionOfferIds": [],
  "technicalDetails": null,
  "recurrence": "ONCE",
  "categories": [
    {
      "path": "addons"
    },
    {
      "path": "addons/durable"
    },
    {
      "path": "applications"
    }
  ],
  "tags": [],
  "customAttributes": [
    {
      "key": "com.epicgames.app.blacklist",
      "value": "[]"
    },
    {
      "key": "publisherName",
      "value": "2K"
    },
    {
      "key": "developerName",
      "value": "Gearbox Software"
    }
  ],
  "keyImages": [
    {
      "type": "ProductLogo",
      "url": "https://cdn1.epicgames.com/catnip/offer/2KGMKT_BL3_DLC6_EPIC_Transparent_Logo_200x100-200x100-6d4193235982af17af178719532da2bc.png",
      "md5": "6d4193235982af17af178719532da2bc",
      "size": 13990,
      "uploadedDate": "2021-04-05T19:45:46.695Z",
      "width": 200,
      "height": 100
    },
    {
      "type": "OfferImageWide",
      "url": "https://cdn1.epicgames.com/catnip/offer/2KGMKT_BL3_DLC6_2560x1440-2560x1440-bd2f5f1e5ea3034d66f751e43e916312.jpg",
      "md5": "bd2f5f1e5ea3034d66f751e43e916312",
      "size": 2092538,
      "uploadedDate": "2021-04-07T20:54:57.230Z",
      "width": 2560,
      "height": 1440
    },
    {
      "type": "OfferImageTall",
      "url": "https://cdn1.epicgames.com/catnip/offer/2KGMKT_BL3_DLC6_EPIC_Mobile_Store_1200x1600-1200x1600-eea1a9f53987e943321d90e015f9d368.jpg",
      "md5": "eea1a9f53987e943321d90e015f9d368",
      "size": 1030238,
      "uploadedDate": "2021-04-07T20:55:11.525Z",
      "width": 1200,
      "height": 1600
    },
    {
      "type": "Thumbnail",
      "url": "https://cdn1.epicgames.com/catnip/offer/2KGMKT_BL3_DLC6_EPIC_Mobile_Store_1200x1600-1200x1600-eea1a9f53987e943321d90e015f9d368.jpg",
      "md5": "eea1a9f53987e943321d90e015f9d368",
      "size": 1030238,
      "uploadedDate": "2021-04-07T20:55:49.858Z",
      "width": 1200,
      "height": 1600
    },
    {
      "type": "CodeRedemption_340x440",
      "url": "https://cdn1.epicgames.com/catnip/offer/2KGMKT_BL3_DLC6_EPIC_Mobile_Store_1200x1600-1200x1600-eea1a9f53987e943321d90e015f9d368.jpg",
      "md5": "eea1a9f53987e943321d90e015f9d368",
      "size": 1030238,
      "uploadedDate": "2021-04-07T20:56:02.263Z",
      "width": 1200,
      "height": 1600
    }
  ],
  "items": [
    {
      "id": "12f2fca1c9304897b581254a0913ac51"
    }
  ],
  "catalogNs": {
    "name": "catnip"
  }
}