{
  "id": "56729462520e4adb9294705ee2140173",
  "namespace": "e23fc0225c474fb7b2b85ed329d74671",
  "title": "Undead Realm:Ego",
  "description": "\"Undead Realm:Ego\" is a FMV game. Players will act Ren Xing, wake up in a mysterious school and meet other survivors to escape the  the school.",
  "longDescription": "<!--textBlock-->\n<!--title-->\n# \"Undead Realm:Ego\" is a FVM game. Players will act Ren Xing, wake up in a mysterious school and meet other survivors to escape  the school.\n<!--text-->\nDeveloper's word\n\n\n\n\"Undead Realm:Ego\" is my third FMV after \"Try and love\" and \"Back\". For those of you who know the previous two games. Thanks for checking out my new game again. And a warm welcome to those new friends who are paying attention to my FMVfor the first time.\n\n\n\nSecondly, I really want to thank all the crew members who worked so hard during the shooting of \"Undead Realm:Ego\". In the weather when the temperature dropped suddenly, at the abandoned school in the wild suburbs with no water and electricity, we managed to finish the shooting after pulling several all-nighters in a row. The actors had it really tough. I was shivering with cold even when I was wrapped in a down jacket, but you guys were still working hard in short sleeves and skirts, so professional. I wouldn't dare to say that \"Undead Realm:Ego\" is the FMV out there, but I believe you guys are the hardest-working cast and crew in domestic movie-game works so far.\n\n\n\n\"Try and love\" was the first trendy FMV I made. To be honest, I'd only give it a 2 or 3 out of 10 myself. Since I hadn't done it before, I just wanted to give it a quick try. And \"Back\" was the first horror FMV I made based on some reflections. Honestly, it could only get a 6 at most. As for \"Undead Realm:Ego\", I'd give myself a 6.5. That extra 0.5 is more for the cast and crew, and also a bit of comfort for myself for daring to try some new shooting styles.\n\n\n\nActually, everyone wants to make game that can score above 8. I've always been thinking about that, and that's what I aimed for when I started the project. But I have to admit the following:\n\n\n\nIt's really hard to write a script. Otherwise, those good writers and good scripts wouldn't be so valuable. Actually, the plot of \"Undead Realm:Ego\" was quite rich at the beginning. But the problem I actually ran into was that the shooting budget I had couldn't support even one-tenth of that content at all. Because presenting the content would require a longer shooting time, and more shooting time means more expenses for the whole crew including the actors and so on. One more day of shooting means one more day of cost. And this leads to the second point I'm gonna mention next.\n\nThe development funds were still limited. \"Try and love\" lost quite a bit of money, and I guess I kinda deserved it since the quality just wasn't up to par. It was like paying tuition. So when \"Back\" was released, I held an event to give out keys for free because I felt I needed to give an explanation to those who bought \"Try and love\". And \"Back\" is at least slightly in the red for now. Maybe after some time, it can get the cost back. But indeed, since then, there hasn't been more money to put into the shooting of new game. I could only put all the income from the first two games into the shooting of \"Undead Realm:Ego\". To put it bluntly, part of the money for \"Undead Realm:Ego\" was borrowed. But considering my ability to pay it back, I didn't dare to borrow too much. After all, I've got a family to support. I can only say that I've done my best to finish this work.\n\nDue to the above two problems, actually, my objective evaluation of the \"Undead Realm:Ego\" is that since horror and supernatural themes are so far from real life, it's really hard for the actors to perform. Maybe for some players, they might even think the acting is funny and fake. I admit that, but I respect the actors' hard work. All I can say is that I'll try my best to use the same actors in all horror FMV to make sure there's some accumulation in acting skills. Actually, the actors can perform well. It's just a matter of how many takes. If one take doesn't work, then do ten takes. But for me, the very practical problem is that after a few takes, it might be dawn and we won't be able to finish shooting at all. The budget I have is only enough to support a crew of about thirty people to shoot for a fixed number of days. There's no budget for even one more day. So it's just a result of making a choice. Life is full of helpless choices. I can only promise that I'll keep putting your purchases into the shooting costs later and try my best to improve the shooting quality. It's the same with the plot. There'll definitely be a huge difference between designing it for ten days and designing it for a month. But for you guys, games might just be something to pass the time in your spare time. But for me, it's what I rely on to make a living. I have to finish it within the specified time, or else I'll go hungry.\n\nFinally, I'll keep going on the path of horror FMV, no matter how difficult it is. Currently, \"Back 2\" is also in preparation. I hope you guys can come and experience the new things brought by \"Undead Realm:Ego\" first. Give me more criticism and suggestions so that my products can get better and better. For the content that didn't meet your expectations, I can only say sorry. I still need to improve my ability. I believe that with the accumulation of experience step by step and more budget, it'll definitely be better. As the old saying goes: If you've got money, give some to support it. If you don't, just come and cheer us on.\n\nCharacter introduction\n\nZhou Yawen\n\nThe intellectual and elegant Chinese teacher is gentle and rational. They can always resolve conflicts in a calm tone, which seems to be the spiritual pillar that everyone can rely on, just like a small sun, bringing warmth and hope to people.\n\n\n\nYang Tiantian\n\nThe shy and kind-hearted white-collar workers in foreign enterprises are full of care for the people around them. Sensitive and delicate, she always unconsciously puts other people's feelings in the first place, but often ignores her inner voice.\n\n\n\nLin Ziqi\n\nFreelance photographer full of personality and charm, decisive, tough, arrogant personality, used to deal with problems independently. Her keen observation and calm attitude make her always find the details that others can't see.\n\n\n\nSun Xiaoya\n\nOptimistic and cheerful beauty experts can always use humorous language to ease the tension. He is outgoing and lively, pays great attention to appearance, pursues perfection, and is the \"atmosphere\" in the crowd.\n\n\n\nLiu Mengqi\n\nSimple and hard-working college students are sensitive, introverted and not good at communication. Gentle and quiet but with a tough heart. In the confusion and fear, she can always use a little bit of weak but firm strength to keep herself going.\n\n\n\nZhang Yuqing\n\nA low-key and quiet girl with deep complex emotions. Weak on the surface, she can show unexpected courage and strength in the face of difficulties, which can not be ignored.\n",
  "status": "ACTIVE",
  "productSlug": null,
  "urlSlug": "822dd49ae66f434889791002c288bc9e",
  "creationDate": "2025-06-11T13:55:57.310Z",
  "lastModifiedDate": "2025-06-11T14:01:51.906Z",
  "effectiveDate": "2025-06-11T14:00:00.000Z",
  "viewableDate": "2025-06-11T13:55:45.000Z",
  "developer": null,
  "seller": {
    "id": "o-qgs8z9aq93x5twgkmadh25n762w8qn",
    "name": "Yiweigame"
  },
  "linkedOfferId": null,
  "isFeatured": false,
  "ignoreOrder": false,
  "freeDays": 0,
  "collectionOfferIds": [],
  "technicalDetails": null,
  "recurrence": "ONCE",
  "categories": [
    {
      "path": "games/edition/base"
    },
    {
      "path": "games/edition"
    },
    {
      "path": "games"
    }
  ],
  "tags": [
    {
      "id": "1218",
      "name": "Horror",
      "namespace": null,
      "aliases": [],
      "operator": null,
      "created": "2019-06-20T12:00:06.599Z",
      "updated": "2025-06-25T02:49:32.167Z",
      "status": "ACTIVE",
      "referenceCount": 832,
      "comment": null
    },
    {
      "id": "1395",
      "name": "Narration",
      "namespace": null,
      "aliases": [],
      "operator": null,
      "created": "2019-06-20T12:01:34.825Z",
      "updated": "2025-06-25T02:49:36.653Z",
      "status": "ACTIVE",
      "referenceCount": 362,
      "comment": null
    },
    {
      "id": "33639",
      "name": "Promotional Content",
      "namespace": null,
      "aliases": [],
      "operator": null,
      "created": "2024-01-30T16:42:20.388Z",
      "updated": "2024-02-05T20:14:29.988Z",
      "status": "ACTIVE",
      "referenceCount": 391,
      "comment": ""
    },
    {
      "id": "1370",
      "name": "Single Player",
      "namespace": null,
      "aliases": [],
      "operator": null,
      "created": "2019-06-20T12:01:22.169Z",
      "updated": "2025-06-25T08:25:48.234Z",
      "status": "ACTIVE",
      "referenceCount": 11180,
      "comment": null
    },
    {
      "id": "9547",
      "name": "Windows",
      "namespace": null,
      "aliases": [],
      "operator": null,
      "created": "2019-10-11T02:43:18.435Z",
      "updated": "2025-06-25T08:35:20.218Z",
      "status": "ACTIVE",
      "referenceCount": 20067,
      "comment": null
    },
    {
      "id": "1294",
      "name": "First Person",
      "namespace": null,
      "aliases": [],
      "operator": null,
      "created": "2019-06-20T12:00:44.596Z",
      "updated": "2025-06-25T02:49:33.755Z",
      "status": "ACTIVE",
      "referenceCount": 1066,
      "comment": null
    }
  ],
  "customAttributes": [
    {
      "key": "autoGeneratedPrice",
      "value": "false"
    },
    {
      "key": "isManuallySetViewableDate",
      "value": "true"
    },
    {
      "key": "isPromotionalContentUsed",
      "value": "true"
    },
    {
      "key": "isManuallySetPCReleaseDate",
      "value": "false"
    },
    {
      "key": "isBlockchainUsed",
      "value": "false"
    }
  ],
  "keyImages": [
    {
      "type": "OfferImageWide",
      "url": "https://cdn1.epicgames.com/spt-assets/6ceeb52f974e433ca67514858213b68c/undead-realmego-1lmwh.jpg",
      "md5": "b0f5b4d673430d3ca1ddeeaa35a127fe",
      "size": 387082,
      "uploadedDate": "2025-06-04T14:50:36.411Z",
      "width": 2560,
      "height": 1440
    },
    {
      "type": "OfferImageTall",
      "url": "https://cdn1.epicgames.com/spt-assets/6ceeb52f974e433ca67514858213b68c/undead-realmego-1rt6i.jpg",
      "md5": "02935209d51c18d1ae347e6712c92fc1",
      "size": 275409,
      "uploadedDate": "2025-06-04T14:50:41.802Z",
      "width": 1200,
      "height": 1600
    },
    {
      "type": "Thumbnail",
      "url": "https://cdn1.epicgames.com/spt-assets/6ceeb52f974e433ca67514858213b68c/undead-realmego-1rt6i.jpg",
      "md5": "02935209d51c18d1ae347e6712c92fc1",
      "size": 275409,
      "uploadedDate": "2025-06-04T14:50:41.802Z",
      "width": 1200,
      "height": 1600
    },
    {
      "type": "heroCarouselVideo",
      "url": "com.epicgames.video://723cc4f8-eb7c-489e-88d3-5e382d2a1f7c?cover=https%3A%2F%2Fcdn1.epicgames.com%2Fspt-assets%2F6ceeb52f974e433ca67514858213b68c%2Fundead-realmego-video-1oz7g.jpg",
      "md5": "comepicgamesvideomd5hashconstant",
      "size": 70281002,
      "uploadedDate": "2025-05-29T16:24:53.276Z",
      "width": 1920,
      "height": 1080
    }
  ],
  "items": [
    {
      "id": "0b42c0a5b39b489ea511558a26523db7"
    }
  ],
  "catalogNs": {
    "name": "e23fc0225c474fb7b2b85ed329d74671"
  }
}