{
  "id": "62552259bdac462ead0efe109ca5b26a",
  "namespace": "f858c9da38e24eb1b3dc0c52f7dc95c9",
  "title": "Food Truck Empire",
  "description": "It's not just about cooking - it's about building an empire! Conquer the streets one fully-customizable food truck at a time. From a small fry to a 5-star champion. Find your customers, fill their bellies and build your Food Truck Empire!",
  "longDescription": "<!--textBlock-->\n<!--title-->\n# 👑 Be a chef. Be a boss. Be an emperor. 👑\n<!--text-->\nFood Truck Empire is an economic strategy/tycoon game where you become an owner of a fast-growing Food Truck enterprise. Your goal is to feed the hungry masses and conquer several unique cities with your amazing food. Only one way to do it - roll up your sleeves, grab the right ingredients and start crafting your own recipes inside your truck!\n\nComposing the dishes by selecting the right ingredients and creating automated assembly lines within your truck are the foundation of your success. Buying new trucks, customizing and equipping them with necessary utilities will let you serve even more customers while researching new technologies will ensure that your company always is ahead of your competition. \n\nWill you make it as a Food Truck Emperor?\n\n<!--image-->\n![Food Truck Empire-1acgk](https://cdn1.epicgames.com/spt-assets/69d12139b9ec48cca78cb28336c4b31d/food-truck-empire-1acgk.gif)\n\n<!--textBlock-->\n<!--text-->\nPeople are hungry. You have food. A match made in heaven? Well… it’s not that simple. \n\nYou design the way magic happens within your trucks! Create quick automated routes between each part of your cooking process - keep them tight and well thought out to ensure the fast delivery! Switch your equipment on the fly and use new ingredients as you unlock them while playing. Buy fresh ingredients, swap appliances that you don’t need for new cool additions to your food truck. It’s almost like toy blocks - easy to use but sizzlingly satisfying.\n\n<!--textBlock-->\n<!--text-->\nDesign easy-yet-complex smart layouts that maximize your cooking efficiency and add several layers to your dishes. It’s basically plug and play… or maybe plug and cook? This way you’ll create many tasty dishes sure to catch your customers’ attention!\n\n<!--image-->\n![Food Truck Empire-2q3dr](https://cdn1.epicgames.com/spt-assets/69d12139b9ec48cca78cb28336c4b31d/food-truck-empire-2q3dr.gif)\n\n<!--textBlock-->\n<!--text-->\nEverybody likes food, but what food will make people fall in love with YOUR food truck chain? \n\nChoose among tens upon tens of different ingredients when deciding about your menu. It’s not “just meat” - you decide exactly whether you’re going to use a pre-packed burger patty or create your own completely from scratch. As you play you will unlock many new ways of handling your food - cooking, baking, frying and more. Use your ingredients well, find new combinations and your dishes will become the talk of the town especially if you remember about your customers' preferences! \n\nYour food truck will evolve as you continue playing - starting with simple dishes consisting of one or two different ingredients is all good and fine but at some point you will start doing multi-leveled marvels of cooking artistry. To create each dish you will use several different automated food preparation processes - all supported by the cozy confines of your truck!\n\nIt’s not just burgers - try your hand at dishes from many diverse cultures. Sushi, tacos, pasta, or maybe some dumplings - you will be able to create all kinds of fast foods.\n\n<!--image-->\n![Food Truck Empire-1k8lg](https://cdn1.epicgames.com/spt-assets/69d12139b9ec48cca78cb28336c4b31d/food-truck-empire-1k8lg.gif)\n\n<!--textBlock-->\n<!--text-->\nPassion for cooking isn’t enough to win your customers’ hearts. You need a strongly optimized pipeline, a fleet of diverse food trucks and a hunger for success on top of that.\n\nBefore you send out your fleet to conquer the streets and offer your customers the best food in the city - make sure your trucks are presentable! Customize their shape, accessories, colors and slap some cool stickers on them. If you’re feeling cheeky you can even draw your own paintings on them!\n\nWhen your trucks look exactly as you’ve imagined you’re finally ready! You’re hitting the road, searching for just the right spot - confident in your cooking process, ingredients and appearance. It’s time for the final culinary confrontation!\n\n<!--image-->\n![Food Truck Empire-man6y](https://cdn1.epicgames.com/spt-assets/69d12139b9ec48cca78cb28336c4b31d/food-truck-empire-man6y.gif)\n\n<!--textBlock-->\n<!--text-->\nImagine your perfect customer - how they look, where they work and how they spend their freetime. Now… scratch that completely and go out on the street to learn the hard way.\n\nThe dynamic neighborhood you will visit in Food Truck Empire is bustling with people with different culinary preferences, likes and dislikes. You have to adapt - if not, then your competition will eat you alive. You will not only have to pick your food according to place and customer base but also take time of the day into account as you will meet different people at different moments. Some customers might prefer meat, some veggies, others however will pick fish. Cooking will be perfect for many but select ones will prefer frying. Check each customer group to see their preferences and what they like to eat - this info will help you make the right decision!\n\nWill you pick a lunch rush downtown, serving busy bankers with deep pockets? Or focus on the old industrial district with hungry workers by day and party goers at night? Make sure to be ready for city-wide events that will influence the way you play the game and give you the chance to capitalize on them!\n\n<!--textBlock-->\n<!--text-->\nNew dishes require a new approach - researching will bring you closer to getting them!\n\nResearching new equipment, ingredients and facilities will bring you closer to becoming a true wish-come-true for many customers. With new ingredients come new amazing dishes - something that you might just need to dazzle that one pesky customer that always takes one star away from their review. With facilities and equipment you will be able to make those dishes faster and even tastier! \n\nConduct your research among several categories to unlock new ingredients, equipment and processes - all necessary to ensure that all parts of your business are in top-notch condition!\n\nEach well received dish brings you much needed motivation to research more and moves the research bar up. When you research everything your food trucks will become technological marvels!\n\n<!--image-->\n![Food Truck Empire-qp36n](https://cdn1.epicgames.com/spt-assets/69d12139b9ec48cca78cb28336c4b31d/food-truck-empire-qp36n.gif)\n\n<!--textBlock-->\n<!--text-->\nGrow your influence and expand your business - there’s nothing more pleasant than seeing your empire grow and prosper!\n\nStart small: with a simple recipe for a good old burger, a truck with one counter and stove on a random street in a big city. Work hard and grow - soon you’ll not only command a fleet of several food trucks, each one fully customized by your artistic eye, but also create culinary masterpieces on the best equipment available in the industry. But don’t stop there! \n\nExpand across different areas and find new customers with different tastes. Discover new dishes and improve upon tried and tested ones.\n\n<!--textBlock-->\n<!--text-->\nAnd even then that’s not all - you’ll be able to design your own HQ & add new departments - unlocking fancy new ways to make people fall in love with your street food. Don’t fall behind - your competitors won’t be waiting around.\n\n<!--textBlock-->\n<!--title-->\n# ⭐🍽️FEATURES 🍽️⭐\n<!--text-->\n- Craft your own tasty dishes within a single food truck\n\n- Discover and use advanced recipes for delicious dishes\n\n- Design a smart automated production system - a perfect workstation\n\n- Customize and equip your food trucks\n\n- Understand the preferences of your customers among several different and unique customer groups\n\n- Aim for getting as many 5-stars reviews as possible\n\n- Compete with other business and extend your area of influence\n\n- Expand your culinary business over different cities with their own groups of customers\n\n- Research new technologies and get new ingredients\n\n- Develop your Headquarters and upgrade it with new facilities\n\n- Take advantage of many different random events happening in the cities\n\n\n… and more!\n",
  "status": "ACTIVE",
  "productSlug": null,
  "urlSlug": "2b5c974a3dba4132b5f2f46d5e07dbdd",
  "creationDate": "2022-03-02T08:33:24.471Z",
  "lastModifiedDate": "2025-02-28T07:52:14.045Z",
  "effectiveDate": "2099-01-01T00:00:00.000Z",
  "viewableDate": "2022-03-14T00:00:00.000Z",
  "developer": null,
  "seller": {
    "id": "o-lmz88mnhcps8hnsethytay7nbnuyk8",
    "name": "Lichthund S.A."
  },
  "linkedOfferId": null,
  "isFeatured": false,
  "ignoreOrder": false,
  "freeDays": 0,
  "collectionOfferIds": [],
  "technicalDetails": null,
  "recurrence": "ONCE",
  "categories": [
    {
      "path": "games"
    },
    {
      "path": "games/edition"
    },
    {
      "path": "games/edition/base"
    }
  ],
  "tags": [
    {
      "id": "1296",
      "name": "Casual",
      "namespace": null,
      "aliases": [],
      "operator": null,
      "created": "2019-06-20T12:00:45.644Z",
      "updated": "2025-06-25T02:49:33.997Z",
      "status": "ACTIVE",
      "referenceCount": 1098,
      "comment": null
    },
    {
      "id": "1370",
      "name": "Single Player",
      "namespace": null,
      "aliases": [],
      "operator": null,
      "created": "2019-06-20T12:01:22.169Z",
      "updated": "2025-06-25T08:25:48.234Z",
      "status": "ACTIVE",
      "referenceCount": 11180,
      "comment": null
    },
    {
      "id": "1115",
      "name": "Strategy",
      "namespace": null,
      "aliases": [],
      "operator": null,
      "created": "2019-06-20T11:59:15.641Z",
      "updated": "2025-06-25T02:49:28.322Z",
      "status": "ACTIVE",
      "referenceCount": 2189,
      "comment": null
    },
    {
      "id": "9547",
      "name": "Windows",
      "namespace": null,
      "aliases": [],
      "operator": null,
      "created": "2019-10-11T02:43:18.435Z",
      "updated": "2025-06-25T08:35:20.218Z",
      "status": "ACTIVE",
      "referenceCount": 20040,
      "comment": null
    },
    {
      "id": "1310",
      "name": "EARLY ACCESS",
      "namespace": "epic",
      "aliases": null,
      "operator": null,
      "created": "2019-06-20T12:00:52.671Z",
      "updated": "2023-08-22T22:50:29.701Z",
      "status": "ACTIVE",
      "referenceCount": 250,
      "comment": null
    },
    {
      "id": "1263",
      "name": "Indie",
      "namespace": null,
      "aliases": [],
      "operator": null,
      "created": "2019-06-20T12:00:29.190Z",
      "updated": "2025-06-25T02:49:32.702Z",
      "status": "ACTIVE",
      "referenceCount": 2223,
      "comment": null
    }
  ],
  "customAttributes": [
    {
      "key": "autoGeneratedPrice",
      "value": "false"
    },
    {
      "key": "isManuallySetViewableDate",
      "value": "true"
    },
    {
      "key": "isPromotionalContentUsed",
      "value": "false"
    },
    {
      "key": "isManuallySetPCReleaseDate",
      "value": "false"
    },
    {
      "key": "isBlockchainUsed",
      "value": "false"
    }
  ],
  "keyImages": [
    {
      "type": "OfferImageWide",
      "url": "https://cdn1.epicgames.com/spt-assets/69d12139b9ec48cca78cb28336c4b31d/food-truck-empire-h0z2n.jpg",
      "md5": "7353e3ed7f0130a94bba67ef601ea264",
      "size": 1710716,
      "uploadedDate": "2025-02-18T10:50:08.889Z",
      "width": 2560,
      "height": 1440
    },
    {
      "type": "OfferImageTall",
      "url": "https://cdn1.epicgames.com/spt-assets/69d12139b9ec48cca78cb28336c4b31d/food-truck-empire-1qzbl.jpg",
      "md5": "e71377f64622785098460c4b7910aed5",
      "size": 908621,
      "uploadedDate": "2025-02-18T10:50:26.120Z",
      "width": 1200,
      "height": 1600
    },
    {
      "type": "Thumbnail",
      "url": "https://cdn1.epicgames.com/spt-assets/69d12139b9ec48cca78cb28336c4b31d/food-truck-empire-1qzbl.jpg",
      "md5": "e71377f64622785098460c4b7910aed5",
      "size": 908621,
      "uploadedDate": "2025-02-18T10:50:26.120Z",
      "width": 1200,
      "height": 1600
    },
    {
      "type": "featuredMedia",
      "url": "https://cdn1.epicgames.com/spt-assets/69d12139b9ec48cca78cb28336c4b31d/food-truck-empire-rr44u.jpg",
      "md5": "370bf79335eb14aabf79f9597c07cd65",
      "size": 438763,
      "uploadedDate": "2022-03-02T09:26:17.413Z",
      "width": 1920,
      "height": 1080
    },
    {
      "type": "featuredMedia",
      "url": "https://cdn1.epicgames.com/spt-assets/69d12139b9ec48cca78cb28336c4b31d/food-truck-empire-1hel8.png",
      "md5": "098f6bcd4621d373cade4e832627b4f6",
      "size": 2635853,
      "uploadedDate": "2024-06-11T08:31:33.903Z",
      "width": 1920,
      "height": 1080
    },
    {
      "type": "featuredMedia",
      "url": "https://cdn1.epicgames.com/spt-assets/69d12139b9ec48cca78cb28336c4b31d/food-truck-empire-bxd5e.png",
      "md5": "098f6bcd4621d373cade4e832627b4f6",
      "size": 2005686,
      "uploadedDate": "2024-06-11T08:30:25.450Z",
      "width": 1920,
      "height": 1080
    },
    {
      "type": "featuredMedia",
      "url": "https://cdn1.epicgames.com/spt-assets/69d12139b9ec48cca78cb28336c4b31d/food-truck-empire-1hxe5.png",
      "md5": "098f6bcd4621d373cade4e832627b4f6",
      "size": 2301820,
      "uploadedDate": "2024-06-11T08:31:32.795Z",
      "width": 1920,
      "height": 1080
    },
    {
      "type": "featuredMedia",
      "url": "https://cdn1.epicgames.com/spt-assets/69d12139b9ec48cca78cb28336c4b31d/food-truck-empire-1jdwh.png",
      "md5": "098f6bcd4621d373cade4e832627b4f6",
      "size": 2627809,
      "uploadedDate": "2024-06-11T08:31:33.265Z",
      "width": 1920,
      "height": 1080
    },
    {
      "type": "featuredMedia",
      "url": "https://cdn1.epicgames.com/spt-assets/69d12139b9ec48cca78cb28336c4b31d/food-truck-empire-1iglr.jpg",
      "md5": "081b14731b739301537ead39718e7199",
      "size": 432000,
      "uploadedDate": "2022-03-02T09:25:56.101Z",
      "width": 1920,
      "height": 1080
    },
    {
      "type": "featuredMedia",
      "url": "https://cdn1.epicgames.com/spt-assets/69d12139b9ec48cca78cb28336c4b31d/food-truck-empire-11llx.png",
      "md5": "098f6bcd4621d373cade4e832627b4f6",
      "size": 3509217,
      "uploadedDate": "2024-06-11T08:31:34.281Z",
      "width": 1920,
      "height": 1080
    }
  ],
  "items": [
    {
      "id": "26cab2f18702485492d9fb76355847da"
    }
  ],
  "catalogNs": {
    "name": "f858c9da38e24eb1b3dc0c52f7dc95c9"
  }
}