{
  "id": "918e1a8d03814ee1a33522d2fe592de4",
  "namespace": "0dfcaeede0214b80b597f08fd7d64b1b",
  "title": "Risk of Rain 2: Seekers of the Storm",
  "description": "An ancient threat awakens on Petrichor V. Master new Survivors, wield new items, and battle across uncharted regions. Ascend the levels of the Colossus in a race to confront The False Son. Defeat him and unlock the true power of his Soul!",
  "longDescription": "# A False Savior\n\nBring retribution to Petrichor V and forge a path to the Colossus to face an ancient threat! \n\nA Soul, born without purpose, locked away and forgotten. The prison was both her sanctuary and shackle. Her fate: doomed by her flawless design. Millennia passed. Her desperation grew, and from the depths of her solitude, she brought another into the world she lost. Now, The False Son walks Petrichor V, bound by the betrayal of his forebearer and the corruption of a King’s blind ambition.\n\n# Conquer the Path of the Colossus\n\nPrepare for an expedition deep into Petrichor V’s lost regions! Ancient Lemurian temples and crashing waterfalls lead the way across new stages. Explore hidden caverns and take in the sulfurous smell of brimstone in the Helminth Hatchery. Fend off scores of Lemurians within their Reformed Altar, or drop into the lush green canopy of the Treeborn Colony.\n\nBut the true threat towers overhead… Travel the path of the Colossus and ascend its levels in a race to confront The False Son. Defeat him and unlock the true power of his Soul! \n\n# Survivor 1: Harness the Essence of Soul with Seeker\n\nThrough her mastery of soul manipulation, Seeker can exact incredible damage on nearby monsters while simultaneously unleashing potent healing to sustain her teammates. This unique combination of brawling and healing defines Seeker as a Survivor. Players who learn to seamlessly flow between these roles will be rewarded with one of the most versatile Survivors to ever grace an escape pod.\n\nOnce you reach a sufficiently tranquil state, you can even bring fallen allies back to life! Seeker’s presence can turn the tide of any battle, offering both devastation and salvation in equal measure. Embrace duality and lead your team to victory!\nSeeker is instantly unlocked for Seekers of the Storm owners. \n\n# Survivor 2: Cook Up Mayhem with Chef!\n\nChef has returned! But this isn’t your grandpa’s Chef bot. Years of combat have hard-boiled his soul and perfected his culinary abilities. The long legs of past Chefs have been swapped with a huge roller—perfect for flattening out a nice, tidy pie crust or steamrolling whatever helpless Lemurians were unfortunate enough to wake up this morning.\n\nThose years of primal culinary misadventures have trained Chef to have incredible control over his trusty cleavers. Hurl them at faraway enemies and call them back to slice and dice with twice the pain. Master the art of the cleaver and filet your way to victory.\n\nPlayers who cook up something truly delicious will unlock Chef! So, get ready to sauté your way through hordes, blend your combat skills with culinary precision, and serve up some justice… à la mode\n\n# Survivor 3: Fight Your Way to Redemption with The False Son\n\nFree The False Son from his shackles and wield his immense power! This construct, carved in the image of Providence, was forged with the corruption of a hollow king and the heart of a golden titan, making him a formidable rival even to Providence himself.\n\nThe False Son excels as an immovable object. His massive scale, incredible health, and unmatched regeneration make him a particularly resilient Survivor. In close-range encounters, his hulking club can crush foes into submission. However, outside of clubbing range, fights become far more challenging. \n\nStrategically use line of sight to draw enemies in or pick them off with carefully thrown Lunar Spikes. Learn to close in on enemies quickly, and you’ll extract the most out of this imposing golem. \n\nOnly one player is required to own Seekers of the Storm to enable the expansion for the whole lobby. Players without Seekers of the Storm will be unable to select the new survivors or permanently unlock new items, logbooks, or other content. \n",
  "status": "ACTIVE",
  "productSlug": null,
  "urlSlug": "risk-of-rain-2--seekers-of-the-storm",
  "creationDate": "2023-11-01T18:46:08.543Z",
  "lastModifiedDate": "2024-08-27T16:46:36.549Z",
  "effectiveDate": "2024-08-27T17:00:00.000Z",
  "viewableDate": "2023-11-08T19:00:00.000Z",
  "developer": null,
  "seller": {
    "id": "o-dcmk65hvycy3kndmqvfg3yn3up87jn",
    "name": "Gearbox Publishing"
  },
  "linkedOfferId": null,
  "isFeatured": false,
  "ignoreOrder": false,
  "freeDays": 0,
  "collectionOfferIds": [],
  "technicalDetails": null,
  "recurrence": "ONCE",
  "categories": [
    {
      "path": "addons"
    },
    {
      "path": "addons/durable"
    },
    {
      "path": "applications"
    }
  ],
  "tags": [
    {
      "id": "9547",
      "name": "Windows",
      "namespace": "epic",
      "aliases": [],
      "operator": null,
      "created": "2019-10-11T02:43:18.435Z",
      "updated": "2023-08-23T05:17:12.978Z",
      "status": "ACTIVE",
      "referenceCount": 16865,
      "comment": null
    }
  ],
  "customAttributes": [],
  "keyImages": [
    {
      "type": "OfferImageTall",
      "url": "https://cdn1.epicgames.com/offer/0dfcaeede0214b80b597f08fd7d64b1b/EGS_RiskofRain2SeekersoftheStorm_GearboxSoftware_DLC_S2_1200x1600-e6123624969b5b80655f8092ea077418",
      "md5": "e6123624969b5b80655f8092ea077418",
      "size": 448478,
      "uploadedDate": "2024-08-20T23:25:03.847Z",
      "width": 1200,
      "height": 1600
    },
    {
      "type": "OfferImageWide",
      "url": "https://cdn1.epicgames.com/offer/0dfcaeede0214b80b597f08fd7d64b1b/EGS_RiskofRain2SeekersoftheStorm_GearboxSoftware_DLC_S1_2560x1440-97501c9352e27af81451926eb34576e5",
      "md5": "97501c9352e27af81451926eb34576e5",
      "size": 525841,
      "uploadedDate": "2024-08-20T23:25:13.474Z",
      "width": 2560,
      "height": 1440
    },
    {
      "type": "Thumbnail",
      "url": "https://cdn1.epicgames.com/offer/0dfcaeede0214b80b597f08fd7d64b1b/EGS_RiskofRain2SeekersoftheStorm_GearboxSoftware_DLC_S2_1200x1600-e6123624969b5b80655f8092ea077418",
      "md5": "e6123624969b5b80655f8092ea077418",
      "size": 448478,
      "uploadedDate": "2024-08-20T23:25:25.963Z",
      "width": 1200,
      "height": 1600
    },
    {
      "type": "ProductLogo",
      "url": "https://cdn1.epicgames.com/offer/0dfcaeede0214b80b597f08fd7d64b1b/EGS_RiskofRain2SeekersoftheStorm_GearboxSoftware_DLC_IC1_200x85-623a1f50307e8a55ceb2df4ac119aab0",
      "md5": "623a1f50307e8a55ceb2df4ac119aab0",
      "size": 32817,
      "uploadedDate": "2024-08-20T23:25:33.766Z",
      "width": 200,
      "height": 85
    },
    {
      "type": "featuredMedia",
      "url": "https://cdn1.epicgames.com/offer/0dfcaeede0214b80b597f08fd7d64b1b/EGS_RiskofRain2SeekersoftheStorm_GearboxSoftware_DLC_G1A_00_1920x1080-ad8d5a5eb9e16798ba76390c55492411",
      "md5": "ad8d5a5eb9e16798ba76390c55492411",
      "size": 347902,
      "uploadedDate": "2024-08-20T23:25:42.489Z",
      "width": 1920,
      "height": 1080
    }
  ],
  "items": [
    {
      "id": "06dd26de97cc4e808fbb09cfd55af805"
    }
  ],
  "catalogNs": {
    "name": "0dfcaeede0214b80b597f08fd7d64b1b"
  }
}