{
  "id": "9a822c548b3c4519895547f0ea6677b7",
  "namespace": "ue",
  "title": "Space Opera Music Toolkit - Volume I",
  "description": "10 High-Quality, Handcrafted Space Opera Tracks (144 Cues)",
  "longDescription": "<h1><u>Space Opera Music Toolkit - Volume I</u></h1><p><br /></p><p>My third release on the Unreal Engine marketplace is the first volume in the Space Opera Music Toolkit.</p><p><br /></p><p>With the latest and greatest instrument libraries &amp; effects available on the market, each music track contains ultra-realistic instruments with delicate and precise articulations at a high quality. Each track conveys a particular emotion, with great care to avoid sounding repetitive and generic.</p><p><br /></p><h2><a href=\"https://www.youtube.com/watch?v&#61;L2EYWCiXq-M\" rel=\"nofollow\">-&gt;Click here for the Youtube preview of the tracks&lt;-</a></h2><p><br /></p><p>Like the music? Want more? <a href=\"https://www.unrealengine.com/marketplace/en-US/profile/Enigmatic&#43;Requiem?count&#61;20&amp;sortBy&#61;effectiveDate&amp;sortDir&#61;DESC&amp;start&#61;0\" rel=\"nofollow\"><em><u>Check out my other packs here!</u></em></a></p><p><br /></p><p><br /></p><h1><u>This Pack Provides 10 Unique Themes</u></h1><p><br /></p><p><strong>Bounty Hunter</strong> - Introduced by a rustic piano, supporting strings add a touch of warmth, before the drums and cymbal announce the full ensemble. Singing violins come together, bringing up the tone to one of importance, with hefty drums filling the space. With brass coming in, the track evolves into a brilliant strength. As the climax reaches its peak, a deep hit signals the end, with the piano and strings slowing as they fade away.</p><p><br /></p><p><strong>Aeon</strong> - Woodwinds take centre stage, to instil a feeling of gentleness yet unease. Violins come in to support, the transition being to one of grandness. With thick brass and booming drums, there is still the hint of something not quite right, despite all the splendour. As the climax ends, the ethnic woodwinds return, quietening along with the strings as the track comes to an end.</p><p><br /></p><p><strong>Supremacy</strong> - Of tension and power, a lush piano supported by an arrangement of strings brings the tone up to one of impending conflict. Powerful drums, blaring horns, tense strings, the allusion to the beginnings of war. And, following rapid hits, choirs come into the fray, as peace is lost and the fight begins. With peace being lost for certain, a mourning piano is accompanied by solemn strings, fading out into the dark beyond.</p><p><br /></p><p><strong>Water World</strong> - An oriental woodwind pierces through the silence, announced by a crashing cymbal, a quiet string section is in support of the melancholy. With sound effects alluding to a tribal scene, the tone changes to one of hope. Vocalists come in to support with bright brass, celebrants of a fortune turned right. The energy of the scene dissipates, with ethnic drums and woodwinds slowly calming down into silence.</p><p><br /></p><p><strong>Desert Wind</strong> - Borrowing from a Middle Eastern influence, a dissonant woodwind is accompanied by worshipping chants. Backing strings of a near-sinister nature, lead strings take the front, before giving way to the woodwinds. Then, as the piece grows, so do the unsettling tones, chants echoing far and wide. The climax arrives, brought by wailing strings, to then be guided out into the night by an otherworldly pad intermixed with the dark backing strings.</p><p><br /></p><p><strong>Lunar Sunset</strong> - A song of mourning, quiet rhythm strings play throughout. At first, they are alone, with brass coming in to build up the emotion. Drums of a slow beat come in midway, building tension, with the strings gaining more and more strength. The lead strings enter, on a sorrowful note, building up with the support of the brass, the zenith is announced by rolling drums and a crash, the power lingering, until that too must fade. All that remains is sorrowful strings, fading away as one’s life does following a grand sacrifice.</p><p><br /></p><p><strong>The Journey</strong> - Weep for those who were lost, yell in praise for what they achieved, and then look to the future. Slow, lush strings open the piece, with a gentle piano soon accompanying. Drawn-out percussion and a lone female singer gradually build up the mournful energy of the track to one of splendour. Thick drums and a violin with intense vibrato come together for the climax, before gently fading away.</p><p><br /></p><p><strong>Adventure Begins</strong> - A constant low beat, supported by strings gradually increasing in volume, build up to convey an apprehension of the unknown. A harp then comes into play, with a piano, alluding to fortune. Then, with epic drums and a lead violin, the scene changes to one of triumph. Rolling drums and crashing percussion quickly dissipate the energy, leaving the drone and the strings to convey a mixture of positivity, and uncertainty.</p><p><br /></p><p><strong>Homeland</strong> - The first of a twin pair of tracks, this first one is a much gentler track than the others, with plenty of space given for environmental sounds. Strings and drums pave the way for otherworldly wind instruments, later accompanied by high-pitched violins. A choir announces the chorus, with booming acoustic hits and thick brass. A piece to convey the wonder, followed by a great challenge, and then relief from overcoming what stood in the way.</p><p><br /></p><p><strong>Expanse</strong> - Sister to the previous track IX, this too has a very gradual intro. More western in theme, it features vibrant lead strings with a quiet, yet thick section backing them. Rolling drums and marcato strings come in later, to then suddenly stop; a lull. Then, rousing brass and glorious drums break the silence with splendour, the other sections and instruments coming together. As the piece reaches the climax, choirs come into the fray, before disappearing as quickly as they arrived, once the final hit comes through. Strings are all that remain, fading gradually into silence.</p><p><br /></p><p><br /></p><h2>Each theme comes with Full, Underscore, Melody, &amp; &lt; 1 Minute versions</h2><p><br /></p><p>Each version comes with:</p><p><br /></p><p><strong>Dynamics Control variants</strong> - Compression applied to the audio, normalizing the loudness of the track. This is important during gameplay, so the audio can be &#34;ducked&#34; (reduced in volume) when needed. E.g. when characters are talking.</p><p><br /></p><p><strong>All audio stems</strong> - The individual audio tracks, such as the Drums, Pianos, Strings Ensemble, Solo Strings, etc.</p><p><br /></p><p>In total, there are <strong><u>144 individual tracks.</u></strong></p>",
  "status": "ACTIVE",
  "productSlug": null,
  "urlSlug": "space-opera-music-toolkit-volume-i",
  "creationDate": "2023-08-18T17:29:27.097Z",
  "lastModifiedDate": "2024-10-09T08:39:02.949Z",
  "effectiveDate": "2023-08-18T17:29:27.067Z",
  "viewableDate": null,
  "developer": null,
  "seller": {
    "id": "o-r48gtzmjhlg3e9bq4b8kvjs76v5fj6",
    "name": "Enigmatic Requiem"
  },
  "linkedOfferId": null,
  "isFeatured": false,
  "ignoreOrder": false,
  "freeDays": 0,
  "collectionOfferIds": [],
  "technicalDetails": "<p>Features:</p><ul><li> 10 Unique Space Opera Themes</li><li> Created with latest &amp; greatest realistic libraries</li><li> Realistic articulations</li><li>Includes Theme/Melody/Underscore/60 Second/Stems/Compressed tracks and cues</li><li>Mixed &amp; Mastered using state of the art VSTs</li></ul><p>Number of Audio Wavs: 144</p><p>Number of Audio Cues: 144</p><p>Sample rate / bit rate: 44,100Hz</p><p>Does music loop: Yes</p><p>Minutes of audio provided: 379</p><p>Supported Development Platforms:</p><p>Windows: Yes</p><p>Mac: Yes</p>",
  "recurrence": "ONCE",
  "categories": [
    {
      "path": "assets"
    },
    {
      "path": "assets/music"
    }
  ],
  "tags": [
    {
      "id": null,
      "name": null,
      "namespace": null,
      "aliases": null,
      "operator": null,
      "created": null,
      "updated": null,
      "status": null,
      "referenceCount": null,
      "comment": null
    },
    {
      "id": null,
      "name": null,
      "namespace": null,
      "aliases": null,
      "operator": null,
      "created": null,
      "updated": null,
      "status": null,
      "referenceCount": null,
      "comment": null
    },
    {
      "id": null,
      "name": null,
      "namespace": null,
      "aliases": null,
      "operator": null,
      "created": null,
      "updated": null,
      "status": null,
      "referenceCount": null,
      "comment": null
    },
    {
      "id": null,
      "name": null,
      "namespace": null,
      "aliases": null,
      "operator": null,
      "created": null,
      "updated": null,
      "status": null,
      "referenceCount": null,
      "comment": null
    },
    {
      "id": null,
      "name": null,
      "namespace": null,
      "aliases": null,
      "operator": null,
      "created": null,
      "updated": null,
      "status": null,
      "referenceCount": null,
      "comment": null
    }
  ],
  "customAttributes": [
    {
      "key": "FabListingId",
      "value": "b87d8e59-6846-431d-9677-ba9c9bedb9fc"
    }
  ],
  "keyImages": [
    {
      "type": "Screenshot",
      "url": "https://cdn1.epicgames.com/ue/product/Screenshot/Cover-1920x1080-e13ed0b8cc104c4e7ce09c1628418d8f.png",
      "md5": "e13ed0b8cc104c4e7ce09c1628418d8f",
      "size": 2937003,
      "uploadedDate": "2023-08-07T13:25:17.536Z",
      "width": 1920,
      "height": 1080
    },
    {
      "type": "Thumbnail",
      "url": "https://cdn1.epicgames.com/ue/product/Thumbnail/SpaceOperaMusicToolkitVolumeI_thumb-284x284-05dd9071de33b353495e0936debddc18.png",
      "md5": "05dd9071de33b353495e0936debddc18",
      "size": 186979,
      "uploadedDate": "2023-08-07T13:25:18.211Z",
      "width": 284,
      "height": 284
    },
    {
      "type": "Featured",
      "url": "https://cdn1.epicgames.com/ue/product/Featured/SpaceOperaMusicToolkitVolumeI_featured-894x488-96dcfda8a2fe15db89fea094551b240b.png",
      "md5": "96dcfda8a2fe15db89fea094551b240b",
      "size": 856869,
      "uploadedDate": "2023-08-07T13:25:18.341Z",
      "width": 894,
      "height": 488
    },
    {
      "type": "Snapshot",
      "url": "https://cdn1.epicgames.com/ue/product/Snapshot/Cover-1920x1080-e13ed0b8cc104c4e7ce09c1628418d8f_Snapshot.png",
      "md5": "540ff939beeca4ff98e5adab32969a5c",
      "size": 8286,
      "uploadedDate": "2023-08-07T13:25:18.061Z",
      "width": 150,
      "height": 74
    }
  ],
  "items": [
    {
      "id": "7a455c8d9443422a87c9c3fab63bc184"
    }
  ],
  "catalogNs": null
}