{
  "id": "af61a7651d6748b6a9a439fd436a07bf",
  "namespace": "c98237093b7f4f108ff63cfcee8e27e2",
  "title": "Head North: The Inevitable",
  "description": "A contemplative single-player first-person action game, you're thrust into a world where evading relentless enemies is your sole chance at survival. Your lifeline? A flawed survival kit. Prepare for a slow-paced, tension-filled experience as you navigate a challenging terrain.",
  "longDescription": "<!--textBlock-->\n<!--title-->\n# Your lifeline? A flawed survival kit. Prepare for a slow-paced, tension-filled experience as you navigate a challenging terrain.\n<!--text-->\n**Brief Overview**\nEmbark on an adrenaline-fueled journey in Head North, where survival is your only option in a world torn apart by conflict.\n\nAs a Russian pilot, you're thrust into chaos when your Sukhoi Su-25 fighter jet is hit by a surface-to-air missile over the war-torn skies of Udy, Ukraine. With lightning reflexes, you eject from your doomed aircraft and parachute into the enemy territory.\n\nBut the trials have only just begun. Multiple injuries sustained during the ejection, parachute descent, and landing have left you battered and broken, affecting your ability to walk, aim, and move with ease. Every step is a struggle, every movement a test of willpower as you navigate the treacherous landscape towards the safety of the Russian-Ukrainian border.\n\nWith each passing moment, the tension mounts as you evade relentless enemies, using every ounce of strength and cunning to outsmart those who seek to end your journey prematurely. And all the while, the headcam footage captures every heart-pounding moment, immersing you in the raw intensity of survival.\n\nPrepare for a slow-paced, tension-filled experience unlike any other as you embark on this harrowing quest for freedom. Can you overcome your injuries, evade your pursuers, and reach the rendezvous point for extraction by a Russian helicopter? The fate of your life hangs in the balance in Head North.\n\n**Key Features**\n\n- **Intense Survival Experience:** Navigate a hostile environment as a Russian pilot stranded in enemy territory after ejecting from your fighter jet.\n- **Realistic Injuries:** Experience the consequences of multiple injuries sustained during ejection, parachuting, and landing, affecting your ability to walk, aim, and move effectively.\n- **First-Person Action:** Immerse yourself in the action with first-person headcam footage, capturing every heart-pounding moment of your struggle for survival.\n- **Strategic Evasion:** Use stealth and cunning to evade relentless enemies and overcome the challenges of a challenging terrain.\n- **Slow-Paced Tension:** Prepare for a slow-paced, tension-filled experience as you carefully navigate the landscape, never knowing what dangers await around the next corner.\n- **Immersive Realism:** Feel the weight of every decision as you confront the harsh realities of war in a realistic and immersive environment.\n- **Dynamic Gameplay:** Adapt to changing circumstances and unexpected obstacles as you strive to reach the rendezvous point for extraction by a Russian helicopter.\n- **Emotional Storytelling:** Experience a gripping narrative of survival and resilience as you fight against overwhelming odds to secure your freedom.\n- **Visceral Action:** Engage in visceral combat encounters as you confront enemies and overcome obstacles in your quest to escape enemy territory.\n- **Unforgettable Journey:** Embark on an unforgettable journey of courage and determination as you face the ultimate test of survival in Head North.\n- **Immersive Audio Experience:** Immerse yourself in the world of Head North with rich sound effects and dynamic soundtracks that adapt to the situation, enhancing the atmosphere and tension throughout your journey.\n- **Short, Intense Gameplay:** Experience the complete journey of Head North in just around 2 hours, offering a concentrated, action-packed experience that keeps you on the edge of your seat from start to finish.\n- **Dynamic Replayability:** Head North is an evolving journey that invites you to explore its depths time and time again. With branching storylines, new starting items, multiple endings, and diverse atmospheres like dark and rainy settings, each playthrough offers a unique and immersive experience. Dive back into the heart-pounding action of Head North and uncover new paths, secrets, and challenges with every replay, ensuring that no two adventures are ever the same.\n",
  "status": "ACTIVE",
  "productSlug": null,
  "urlSlug": "03ce0e1bcf7144ab877b54530f17412f",
  "creationDate": "2023-11-03T21:34:35.635Z",
  "lastModifiedDate": "2025-01-18T20:38:42.815Z",
  "effectiveDate": "2099-01-01T00:00:00.000Z",
  "viewableDate": "2024-09-24T05:25:05.271Z",
  "developer": null,
  "seller": {
    "id": "o-pw9n8xft6bvzyjh7hgcmtgccdtk2ga",
    "name": "JAMAL SAID"
  },
  "linkedOfferId": null,
  "isFeatured": false,
  "ignoreOrder": false,
  "freeDays": 0,
  "collectionOfferIds": [],
  "technicalDetails": null,
  "recurrence": "ONCE",
  "categories": [
    {
      "path": "games/edition/base"
    },
    {
      "path": "games/edition"
    },
    {
      "path": "games"
    }
  ],
  "tags": [
    {
      "id": "1393",
      "name": "Simulation",
      "namespace": null,
      "aliases": [],
      "operator": null,
      "created": "2019-06-20T12:01:33.848Z",
      "updated": "2025-06-25T02:49:36.519Z",
      "status": "ACTIVE",
      "referenceCount": 2138,
      "comment": null
    },
    {
      "id": "1080",
      "name": "Survival",
      "namespace": null,
      "aliases": [],
      "operator": null,
      "created": "2019-06-20T11:58:58.070Z",
      "updated": "2025-06-25T02:49:27.198Z",
      "status": "ACTIVE",
      "referenceCount": 1160,
      "comment": null
    },
    {
      "id": "1370",
      "name": "Single Player",
      "namespace": null,
      "aliases": [],
      "operator": null,
      "created": "2019-06-20T12:01:22.169Z",
      "updated": "2025-06-25T08:25:48.234Z",
      "status": "ACTIVE",
      "referenceCount": 11180,
      "comment": null
    },
    {
      "id": "9547",
      "name": "Windows",
      "namespace": null,
      "aliases": [],
      "operator": null,
      "created": "2019-10-11T02:43:18.435Z",
      "updated": "2025-06-25T08:35:20.218Z",
      "status": "ACTIVE",
      "referenceCount": 20050,
      "comment": null
    },
    {
      "id": "1294",
      "name": "First Person",
      "namespace": null,
      "aliases": [],
      "operator": null,
      "created": "2019-06-20T12:00:44.596Z",
      "updated": "2025-06-25T02:49:33.755Z",
      "status": "ACTIVE",
      "referenceCount": 1066,
      "comment": null
    }
  ],
  "customAttributes": [
    {
      "key": "autoGeneratedPrice",
      "value": "false"
    },
    {
      "key": "isManuallySetViewableDate",
      "value": "true"
    },
    {
      "key": "isPromotionalContentUsed",
      "value": "false"
    },
    {
      "key": "isManuallySetPCReleaseDate",
      "value": "false"
    },
    {
      "key": "isBlockchainUsed",
      "value": "false"
    }
  ],
  "keyImages": [
    {
      "type": "OfferImageWide",
      "url": "https://cdn1.epicgames.com/spt-assets/4f11ace171d549d8a332d8928907b247/head-north-the-inevitable-g7xuf.jpg",
      "md5": "112d16a52c9138959d1bd2dc6f92ed4d",
      "size": 1075292,
      "uploadedDate": "2024-09-21T21:02:52.812Z",
      "width": 2560,
      "height": 1440
    },
    {
      "type": "OfferImageTall",
      "url": "https://cdn1.epicgames.com/spt-assets/4f11ace171d549d8a332d8928907b247/head-north-the-inevitable-13d5v.jpg",
      "md5": "d046841d794e4332ebf87fb36f8b99e2",
      "size": 652907,
      "uploadedDate": "2024-09-21T21:03:47.133Z",
      "width": 1200,
      "height": 1600
    },
    {
      "type": "Thumbnail",
      "url": "https://cdn1.epicgames.com/spt-assets/4f11ace171d549d8a332d8928907b247/head-north-the-inevitable-13d5v.jpg",
      "md5": "d046841d794e4332ebf87fb36f8b99e2",
      "size": 652907,
      "uploadedDate": "2024-09-21T21:03:47.133Z",
      "width": 1200,
      "height": 1600
    }
  ],
  "items": [
    {
      "id": "07dd1f6538ef4ab78fdfb571229d1c8a"
    }
  ],
  "catalogNs": {
    "name": "c98237093b7f4f108ff63cfcee8e27e2"
  }
}