{
  "id": "b90d20efd0b14ac3bca6e7fe48ef1e07",
  "namespace": "42f7c7174a8a45d4a1189b3d0a267f43",
  "title": "The Shadows Within: Nightmare's Game - Demo",
  "description": "Explore Ebonvale as Elena Hartfield in The Shadows Within: Nightmare’s Game - demo. Uncover dark secrets leading to the main game with three modes: story mode for the narrative, visual mode for atmosphere, and co-op mode to survive with friends.",
  "longDescription": "<!--textBlock-->\n<!--title-->\n# The Shadows Within: Nightmare's Game – Demo invites you to the heart of fear. Are you ready?\n<!--text-->\nThere are whispers in the shadows of the town. Something is watching you at every corner, with every step. The streets of Ebonvale may be quiet, but that silence is deceiving. It’s the calm before the storm... The Shadows Within: Nightmare's Game – Demo will take you not only on a survival adventure but to the darkest depths of terror. Can your heart endure? Are you ready to face true fear?\n\n\n\n**A Town, A Curse, A Story...**\n\n\nEbonvale was once a peaceful place, but now it's turned into a town where nightmares come true. Wandering the streets are deranged creatures, and lurking in the depths are even more terrifying things. This demo opens the darkest corners of Ebonvale for you. Although it's just a taste, it will be enough to introduce you to the real face of horror. \n\n**What Awaits You in This Demo?**\n\nYou will step into the darkness with three different modes, each allowing you to experience the horror of Ebonvale from a different perspective. But there's one thing common in all modes: the silence that draws you in and the feeling that danger could strike at any moment…\n\n\n**Story Mode: Pursuing Fear with Elena Hartfield**\n\nEbonvale's dark secrets are entwined with Elena Hartfield's destiny. In this mode, you will discover the events leading up to the full game and witness Elena’s fight against the town’s curse. The shadows of the town follow you with every step. Crumbling buildings, empty streets, a sense of nothingness... But even in this emptiness, something is there—close enough to touch. By gathering clues about Ebonvale's past, you will journey toward the heart of darkness.\n\nEvery door, every discovery brings more questions. In Elena's fight for survival, it’s not just your courage but also your mind that will keep you alive. You will need to solve puzzles, but where will these secrets lead you? Every clue you uncover will reveal a darker truth. And remember: once some doors are opened, they cannot be closed again.\n\n\n**Visual Mode: Discover the Details of Fear**\n\nIn this mode, leave the action behind and focus on the visual details of Ebonvale. As a journalist, you roam the decaying surface of the town. The terrifying atmosphere of the town—rotting houses, abandoned shops, a supernatural gloom—unfolds with every step. This mode lets you fully experience the technological and visual power of the game.\n\nBut don’t let the visual beauty deceive you. The quietest moments of fear are often when it’s closest. You will feel the presence of something watching you around every corner. Visual Mode is not just a feast for the eyes; it’s also a nerve-wracking, unsettling experience. Do you dare to explore the aesthetics of fear?\n\n\n**Alliance of the Brave (Co-Op Mode): Unite to Survive**\n\nEntering this town alone takes courage, but sharing the fear is no easy task. In Alliance of the Brave mode, you and up to four players will take on the role of soldiers trying to stop this disaster. You will join forces with your friends and fight your way to the heart of the darkness. But beware: this town is difficult to overcome, even with a team.\n\nDevelop strategies with your teammates, defeat enemies, and survive the dangerous streets. Each stage will take you deeper into the town, and every step will bring more danger. In this mode, you’ll have to face not only fear but also the mistakes of your teammates. Being a good team is essential to survival, but can they all keep up with you?\n\n\n**What to Expect in This Demo**\n\nThis demo may only be a small part of the full game, but it will make you feel the horror the town has to offer. You will delve into the story, uncover the town’s secrets, and try to find your way in the darkness. Horror is not just about the monsters you face; it’s also the tension that comes from confronting the unknown.\n\nAre you strong enough to protect yourself? More importantly, are you brave enough to keep your sanity? This demo is a short journey into the nightmare of Ebonvale, but remember: fear never ends so quickly.\n\n\n**Dare to Step In**\n\nThe darkness awaits you. Every decision you make, every move you take will make a difference in this world. Think carefully and feel deeply—because one wrong step could cost you dearly. Discover Elena's fears in story mode, explore the terrifying beauty of the town in visual mode, or fight for survival with friends in co-op mode. But whatever you do, don’t let fear consume you. The secrets of Ebonvale are waiting.\n\n**Are you ready to face the darkness? Then, begin. But be warned: not everyone makes it out of this town alive…**\n",
  "status": "ACTIVE",
  "productSlug": null,
  "urlSlug": "the-shadows-within-nightmare-s-game-demo",
  "creationDate": "2024-08-16T08:49:26.237Z",
  "lastModifiedDate": "2024-10-18T15:07:52.763Z",
  "effectiveDate": "2099-01-01T00:00:00.000Z",
  "viewableDate": "2024-08-18T07:04:37.230Z",
  "developer": null,
  "seller": {
    "id": "o-3y6sfg9lzfyyc2ulhmgdrvuhw388lk",
    "name": "Netrigo Game Studios"
  },
  "linkedOfferId": null,
  "isFeatured": false,
  "ignoreOrder": false,
  "freeDays": 0,
  "collectionOfferIds": [],
  "technicalDetails": null,
  "recurrence": "ONCE",
  "categories": [
    {
      "path": "games"
    },
    {
      "path": "games/demo"
    }
  ],
  "tags": [
    {
      "id": "1264",
      "name": "Co-op",
      "namespace": "epic",
      "aliases": [],
      "operator": null,
      "created": "2019-06-20T12:00:29.700Z",
      "updated": "2023-08-23T03:55:35.380Z",
      "status": "ACTIVE",
      "referenceCount": 1166,
      "comment": null
    },
    {
      "id": "1218",
      "name": "Horror",
      "namespace": "epic",
      "aliases": [],
      "operator": null,
      "created": "2019-06-20T12:00:06.599Z",
      "updated": "2023-08-22T19:55:04.197Z",
      "status": "ACTIVE",
      "referenceCount": 414,
      "comment": null
    },
    {
      "id": "1080",
      "name": "Survival",
      "namespace": "epic",
      "aliases": [],
      "operator": null,
      "created": "2019-06-20T11:58:58.070Z",
      "updated": "2023-08-22T19:55:04.175Z",
      "status": "ACTIVE",
      "referenceCount": 763,
      "comment": null
    },
    {
      "id": "1336",
      "name": "Action-Adventure",
      "namespace": "epic",
      "aliases": [],
      "operator": null,
      "created": "2019-06-20T12:01:05.439Z",
      "updated": "2023-08-23T03:24:56.304Z",
      "status": "ACTIVE",
      "referenceCount": 519,
      "comment": null
    },
    {
      "id": "1370",
      "name": "Single Player",
      "namespace": "epic",
      "aliases": [],
      "operator": null,
      "created": "2019-06-20T12:01:22.169Z",
      "updated": "2023-08-23T05:17:12.951Z",
      "status": "ACTIVE",
      "referenceCount": 5001,
      "comment": null
    },
    {
      "id": "9547",
      "name": "Windows",
      "namespace": "epic",
      "aliases": [],
      "operator": null,
      "created": "2019-10-11T02:43:18.435Z",
      "updated": "2023-08-23T05:17:12.978Z",
      "status": "ACTIVE",
      "referenceCount": 15992,
      "comment": null
    },
    {
      "id": "9549",
      "name": "Controller Support",
      "namespace": "epic",
      "aliases": [],
      "operator": null,
      "created": "2019-10-11T02:43:42.533Z",
      "updated": "2023-08-23T03:24:56.337Z",
      "status": "ACTIVE",
      "referenceCount": 3051,
      "comment": null
    },
    {
      "id": "10719",
      "name": "Mac OS",
      "namespace": "epic",
      "aliases": [
        "OSX",
        "macOS"
      ],
      "operator": null,
      "created": "2019-10-11T02:43:27.812Z",
      "updated": "2023-08-23T05:08:24.605Z",
      "status": "ACTIVE",
      "referenceCount": 1285,
      "comment": null
    }
  ],
  "customAttributes": [
    {
      "key": "autoGeneratedPrice",
      "value": "true"
    },
    {
      "key": "isManuallySetViewableDate",
      "value": "true"
    },
    {
      "key": "isPromotionalContentUsed",
      "value": "false"
    },
    {
      "key": "isManuallySetPCReleaseDate",
      "value": "false"
    },
    {
      "key": "isBlockchainUsed",
      "value": "false"
    }
  ],
  "keyImages": [
    {
      "type": "OfferImageWide",
      "url": "https://cdn1.epicgames.com/spt-assets/31fbabab90b94e2ab24261aefbdc6c19/the-shadows-within-nightmares-games-kd8n2.png",
      "md5": "5dfb70313db53f1a800f441bde8ea203",
      "size": 1426083,
      "uploadedDate": "2024-10-09T21:06:06.545Z",
      "width": 2560,
      "height": 1440
    },
    {
      "type": "OfferImageTall",
      "url": "https://cdn1.epicgames.com/spt-assets/31fbabab90b94e2ab24261aefbdc6c19/the-shadows-within-nightmares-games-brv23.png",
      "md5": "213b5ca4275b03be906a7b4c5acf6f13",
      "size": 873152,
      "uploadedDate": "2024-10-09T21:04:55.601Z",
      "width": 1200,
      "height": 1600
    },
    {
      "type": "Thumbnail",
      "url": "https://cdn1.epicgames.com/spt-assets/31fbabab90b94e2ab24261aefbdc6c19/the-shadows-within-nightmares-games-brv23.png",
      "md5": "213b5ca4275b03be906a7b4c5acf6f13",
      "size": 873152,
      "uploadedDate": "2024-10-09T21:04:55.601Z",
      "width": 1200,
      "height": 1600
    },
    {
      "type": "featuredMedia",
      "url": "https://cdn1.epicgames.com/spt-assets/31fbabab90b94e2ab24261aefbdc6c19/the-shadows-within-nightmares-games-1sa9r.png",
      "md5": "098f6bcd4621d373cade4e832627b4f6",
      "size": 2799315,
      "uploadedDate": "2024-08-17T18:00:08.599Z",
      "width": 1920,
      "height": 1080
    }
  ],
  "items": [
    {
      "id": "236b4319d19044f18c9800c48d73a8a6"
    }
  ],
  "catalogNs": {
    "name": "42f7c7174a8a45d4a1189b3d0a267f43"
  }
}