{
  "id": "c62074a3f6f1403f8c20ad7d14e8c3fd",
  "namespace": "f5fdb08368b845aa9c27df5cb6995a24",
  "title": "Workers & Resources: Soviet Republic",
  "description": "Build a soviet republic from an impoverished country into a rich industrial superpower in a city builder with intricate production chains and a fully simulated global economy. Manage the lives of your citizens from education to work and party loyalty to criminal activity.",
  "longDescription": "<!--textBlock-->\n<!--text-->\n### ABOUT THIS GAME\n\n<!--image-->\n![Workers And Resources: Soviet Republic-1rcte](https://cdn1.epicgames.com/spt-assets/298d97b1df7d4111b4b0a85045735ccc/workers-and-resources-soviet-republic-1rcte.png)\n\n<!--textBlock-->\n<!--text-->\nManage all aspects of your republic in this soviet-themed city builder game. A planned economy puts you in control of everything from mining resources to manufacturing goods and providing services – use this power to make decisions that impact your citizens’ day-to-day lives and their ultimate loyalty to the nation. Whether it’s construction, transportation, trade, healthcare, education, entertainment, tourism, or any of the countless other facets of a full-fledged city, it’s up to you to determine availability, accessibility, and quality. Contend with a deep simulation of global supply chains as you seek fertile soils, ore veins, and viable lands upon which to build your nation – let the radio stations sing your praises and the citizens rejoice in their glorious soviet republic.\n\n<!--image-->\n![Workers And Resources: Soviet Republic-bh4sh](https://cdn1.epicgames.com/spt-assets/298d97b1df7d4111b4b0a85045735ccc/workers-and-resources-soviet-republic-bh4sh.png)\n\n<!--image-->\n![Workers And Resources: Soviet Republic-t1atz](https://cdn1.epicgames.com/spt-assets/298d97b1df7d4111b4b0a85045735ccc/workers-and-resources-soviet-republic-t1atz.png)\n\n<!--textBlock-->\n<!--text-->\nMultiple complex simulations work together to bring your cities to life in Workers & Resources: Soviet Republic – whether it’s the price of goods in the global market, the proper distribution of electricity and water, or the increased supply of heat during the winter months, everything can be manipulated with the right actions. Adjust your game settings based on your appetite for complexity in particular areas – civil engineers, urban planners, economists, and simulation enthusiasts will all be able to experience the mechanics they love.\n\n- Run your nation with both rubles and dollars as you strike a balance between eastern and western markets, trading with nations from either side of the Iron Curtain to gain access to valuable currency, resources, and technology. Despite following a soviet-styled planned economy, you are a fledgling non-aligned nation – this sets you free to engage in trade with both the Western Bloc and the Soviet Bloc to your benefit. Loyalty to one side is always an option, but flooding one market with your goods might result in diminishing returns, and shunning the other side might see you cut off from useful technological advances.\n- Familiarize yourself with the intricacies of realistic supply-chain management with over 30 commodities to acquire, manufacture, and transport. Raw materials, processed goods, and waste material all have specific places where they can be stored, with specific vehicles needed for their transportation, and specific structures needed for loading and unloading. Liquids are stored in tanks and moved with the help of pipes and pumps, or loaded onto vehicles with tanks. Mined ores are stored in aggregate storage facilities, and moved with conveyor belts and flatbed trucks and train cars. Processed goods, meanwhile, are shipped around in covered trucks and train cars, and stored in warehouses. Organize forklifts for short distance hauling, build intricate conveyor belt networks to minimize your reliance on vehicles, or use trains to haul goods from one city to another – supply-chain management is an integral part of operating a nation, and you’ll use everything from cargo planes to freight trains to cargo helicopters to make sure everything is operating smoothly.\n- Every road, bridge, residential building, and factory is built from the ground up with resource costs reflecting the size of the project. Pay market rates for raw materials to execute quick builds with the help of foreign labor, or establish construction offices and provide employment to your population as they head to construction sites to build everything using locally acquired resources. Buildings can require anything from prefab panels, to steel beams, gravel, concrete, and more – produce and supply them locally, or import them to simplify the process. Will you be a self-reliant republic, or will you exploit the international market for rapid expansion?\n\n<!--image-->\n![Workers And Resources: Soviet Republic-iigwq](https://cdn1.epicgames.com/spt-assets/298d97b1df7d4111b4b0a85045735ccc/workers-and-resources-soviet-republic-iigwq.png)\n\n<!--image-->\n![Workers And Resources: Soviet Republic-ziybj](https://cdn1.epicgames.com/spt-assets/298d97b1df7d4111b4b0a85045735ccc/workers-and-resources-soviet-republic-ziybj.png)\n\n<!--textBlock-->\n<!--text-->\nA nation is nothing without its people – they work the fields, bake the bread, and operate the heavy machinery that keeps the wheels of industry turning. Ensuring the people remain happy and loyal is essential to your success.\n\n- Follow your citizens from childhood to the end of their lives, providing them with essential goods such as food and clothes (and alcohol) while simultaneously ensuring they have access to opportunities in the form of education and employment. Be wary of those that lack loyalty to the republic – they are prone to a life of crime, and their reduced efficiency can hurt throughput. Oftentimes, they are best left without access to opportunities where they can do more harm than good. Monitor your nation’s overall happiness and loyalty to ensure few are choosing to leave – provide them with better lives, or rely on propaganda to get the most out of your citizens.\n- Your peoples’ needs can be imported from neighboring countries, or they can be manufactured locally through complex production chains. Massive fields will harvest grains that can be turned into bread and booze at food factories and distilleries. Clothes factories will produce clothes as long as they have fabric, which in turn is produced at fabric factories with the help of crops, chemicals, and water. Manufacture or otherwise acquire all manner of goods, from the aforementioned necessities to the luxuries of radios and TVs, and transport them from factories to warehouses to local stores where your citizens can obtain them to fulfill their needs. \n- There are many essential services your citizens will want access to as well – electricity, water, and heat are necessary for survival, each with their own supply chains to maintain. Watch for demand to ebb and flow with the seasons, and prepare for harsh winters lest your population suffers a sudden tragic drop. Education is provided through schools and universities, with higher levels of education opening up additional employment opportunities for your people, unlocking access to new technologies and production capabilities in your nation. Entertainment comes from local parks and theaters as well as radio and TV stations, while physical fitness is provided by local pools and sports fields. Ensuring these services are available and within reach through an efficient transit system is essential for a healthy, prosperous populace.\n\n<!--image-->\n![Workers And Resources: Soviet Republic-10t38](https://cdn1.epicgames.com/spt-assets/298d97b1df7d4111b4b0a85045735ccc/workers-and-resources-soviet-republic-10t38.png)\n\n<!--image-->\n![Workers And Resources: Soviet Republic-1vwc0](https://cdn1.epicgames.com/spt-assets/298d97b1df7d4111b4b0a85045735ccc/workers-and-resources-soviet-republic-1vwc0.png)\n\n<!--textBlock-->\n<!--text-->\nFrom roads to railways, and from sea to sky, managing the transportation of goods and people is vital to the health of your republic. As your nation spreads and cities develop around resource hubs littered across massive maps, you’ll find yourself constantly expanding your transportation network to meet ever-growing needs.\n\n- Buses, trams, trains, subways, ships, and planes provide public transportation for people to move greater and greater distances, fulfilling needs at distant shops, or providing their expertise at far-flung factories and mines. Operate interconnected systems to facilitate the movement of people across these massive expanses, even using cable cars and winding dirt roads to provide access to the more remote parts of your republic.\n- Trucks, trains, cargo planes, and cargo ships are essential for moving resources long distances, with different subcategories of each vehicle determining exactly what type of goods it can move. Limited access to certain vehicles might force you to explore transit methods you would otherwise have left behind – or perhaps you’ll build connections at customs offices along your border to enable trade with foreign powers instead?\n- Build custom airports, plan the placement of train signals, and design intricate interchanges to truly customize your transit networks. Road signs will influence speed limits and vehicle access, runway length will determine accessibility for various kinds of airplanes, and train stations can be built for passengers or cargo, with access points for pumps, conveyor belts, and forklifts to integrate smoothly into your existing supply chains. \n- Allow your people to purchase cars for private transit, but consider limiting access to such vehicles based on education levels or party loyalty to prevent the plague of freedom of movement and congestion – with well planned infrastructure and transit networks, you can fully control the flow of workers and resources alike.\n",
  "status": "ACTIVE",
  "productSlug": null,
  "urlSlug": "87280319c0784c769e98631f34903d8c",
  "creationDate": "2024-05-07T11:41:35.995Z",
  "lastModifiedDate": "2024-12-13T18:00:10.095Z",
  "effectiveDate": "2024-06-20T17:00:00.000Z",
  "viewableDate": "2024-05-24T14:00:00.000Z",
  "developer": null,
  "seller": {
    "id": "o-4ftedygtvtsgp7tbaf49mpm7lt6u2e",
    "name": "Hooded Horse Inc."
  },
  "linkedOfferId": null,
  "isFeatured": false,
  "ignoreOrder": false,
  "freeDays": 0,
  "collectionOfferIds": [],
  "technicalDetails": null,
  "recurrence": "ONCE",
  "categories": [
    {
      "path": "games/edition/base"
    },
    {
      "path": "games/edition"
    },
    {
      "path": "games"
    }
  ],
  "tags": [
    {
      "id": "1393",
      "name": "Simulation",
      "namespace": "epic",
      "aliases": [],
      "operator": null,
      "created": "2019-06-20T12:01:33.848Z",
      "updated": "2023-08-23T03:55:35.422Z",
      "status": "ACTIVE",
      "referenceCount": 943,
      "comment": null
    },
    {
      "id": "19847",
      "name": "Achievements",
      "namespace": null,
      "aliases": [],
      "operator": null,
      "created": "2022-02-23T20:19:16.824Z",
      "updated": "2023-08-23T01:02:46.275Z",
      "status": "ACTIVE",
      "referenceCount": 4732,
      "comment": ""
    },
    {
      "id": "1370",
      "name": "Single Player",
      "namespace": "epic",
      "aliases": [],
      "operator": null,
      "created": "2019-06-20T12:01:22.169Z",
      "updated": "2023-08-23T05:17:12.951Z",
      "status": "ACTIVE",
      "referenceCount": 5001,
      "comment": null
    },
    {
      "id": "1115",
      "name": "Strategy",
      "namespace": "epic",
      "aliases": [],
      "operator": null,
      "created": "2019-06-20T11:59:15.641Z",
      "updated": "2023-08-23T05:08:24.575Z",
      "status": "ACTIVE",
      "referenceCount": 1068,
      "comment": null
    },
    {
      "id": "9547",
      "name": "Windows",
      "namespace": "epic",
      "aliases": [],
      "operator": null,
      "created": "2019-10-11T02:43:18.435Z",
      "updated": "2023-08-23T05:17:12.978Z",
      "status": "ACTIVE",
      "referenceCount": 17135,
      "comment": null
    }
  ],
  "customAttributes": [
    {
      "key": "autoGeneratedPrice",
      "value": "false"
    },
    {
      "key": "isManuallySetViewableDate",
      "value": "true"
    },
    {
      "key": "isPromotionalContentUsed",
      "value": "null"
    },
    {
      "key": "isManuallySetPCReleaseDate",
      "value": "false"
    },
    {
      "key": "isBlockchainUsed",
      "value": "false"
    }
  ],
  "keyImages": [
    {
      "type": "OfferImageWide",
      "url": "https://cdn1.epicgames.com/spt-assets/298d97b1df7d4111b4b0a85045735ccc/workers-and-resources-soviet-republic-1tkh1.jpg",
      "md5": "c39c307eaea78474078b007797bceaf9",
      "size": 993613,
      "uploadedDate": "2024-06-03T16:59:52.048Z",
      "width": 2560,
      "height": 1440
    },
    {
      "type": "OfferImageTall",
      "url": "https://cdn1.epicgames.com/spt-assets/298d97b1df7d4111b4b0a85045735ccc/workers-and-resources-soviet-republic-173sf.jpg",
      "md5": "9d93b372a78743660b8a86ed4470ba10",
      "size": 564094,
      "uploadedDate": "2024-06-03T16:59:55.572Z",
      "width": 1200,
      "height": 1600
    },
    {
      "type": "Thumbnail",
      "url": "https://cdn1.epicgames.com/spt-assets/298d97b1df7d4111b4b0a85045735ccc/workers-and-resources-soviet-republic-173sf.jpg",
      "md5": "9d93b372a78743660b8a86ed4470ba10",
      "size": 564094,
      "uploadedDate": "2024-06-03T16:59:55.572Z",
      "width": 1200,
      "height": 1600
    }
  ],
  "items": [
    {
      "id": "354471f5433f475ea755ad8a027c8fa0"
    }
  ],
  "catalogNs": {
    "name": "f5fdb08368b845aa9c27df5cb6995a24"
  }
}