{
  "id": "cabda7415da34c8b835fdbfbfe293dd2",
  "namespace": "3c52fbac843d4375803187739db84801",
  "title": "Intrigue Expansion",
  "description": "Choose your government, establish commonwealths, and lead your people through major crises. Politics are here on a galactic scale in Galactic Civilizations III: Intrigue!",
  "longDescription": "# About this DLC\n\nChoose your government, establish commonwealths, and lead your people through major crises. Politics are here on a galactic scale in Galactic Civilizations III: Intrigue!\n\nChoose how best to rule your galaxy by establishing a government, buy and sell rare resources using the new Galactic Market, put your colonies on the path to independence with a commonwealth, and more! Intrigue answers the big questions about governing an entire civilization across hundreds of planets and an enormous galaxy.\n\nYou’ll need to keep your approval rating high among your people in order to maintain control of the government. Tax the people too much or make too many bad decisions and you’ll be sure to lose the next election. How you react during one of several crises events can also turn the tides of your people’s favor - for better or for worse.\n\nSo, what kind of ruler are you? Are you a dictator, or a statesman? Benevolent, or malevolent? Will you risk lives and spend resources to save a small group of your people, or will you sacrifice them for the greater good? Answer these questions and more in Galactic Civilizations III: Intrigue!\n\nOne enormous galaxy to explore. Thousands of planets ripe for settling. Hundreds of colonies looking for leadership: you.\n\n# Core Features:\n\n**Choose your form of government**\nRule with a gentle touch - or, with an iron fist! Choose from 20 available government styles and set your civilization on a path to greatness. Each style of governing has advantages and disadvantages. You can rule democratically, but you’ll need to make sure to keep the favor of your people so you don’t lose the next election. You can also adopt an Owner Aristocracy to enslave your working class, or choose an Interstellar Plutocracy and allow your corporations to rule, and then the opinions of your people don’t matter! \n\n**See your Civilization through unexpected Crises**\nChoose your own adventure! Special events can pop up and throw a wrench into your plans for your civilization. These events, called “Crises,” are navigated through a series of choices that you make. You might have to quell a group of violent revolutionaries, or rally your forces against a massive space creature lurking at the fringes of your empire. How you decide to handle each situation will affect what events, options, opportunities, and rewards become available to you.\n\n**Establish a commonwealth**\nPut your colonies on a path to self-sufficiency! As your empire grows, worlds on the outskirts will want to become independent. These subject-states will do as they’re told without you having to lift a finger. By granting these worlds a status of commonwealth, they will be converted into an ally with a favorable disposition and will be inclined to implement your requests on the galactic scene, as well as provide a substantial stipend back to your home civilization.\n\n\n**Shop in the updated Galactic Bazaar**\nThere’s always a good deal at the Bazaar! Well, maybe not always, but that’s what they’ll tell you, anyway. Mercenaries aren’t the only thing available here anymore. You’ll be able to purchase (and sell!) additional resources now - but, how steep the price gets depends entirely on how much is (or isn’t) available.\n\n**Trade on the Galactic Market**\nThere’s always a good deal at the market! Well, maybe not always, but that’s what they’ll tell you, anyway. Sell Durantium before extensive mining drives down the price, or pay a premium to get some Elerium to construct that new prototype flagship you’ve been wanting. How steep the price gets depends entirely on how much is (or isn’t) available, so buy and sell with care!\n\n**Keep up with current events using the Galactic News Network**\nIn space, there is no biased reporting - that’s because we’ve hired a robot to handle it! Check the news to monitor who’s allying with who, who’s declared war on each other, and many other activities that are going on across the galaxy. Keeping up with current events and galactic happenings is the best way to stay one step ahead of your opponents.\n\n**Explore exciting new content**\nBe prepared for anything! From famine to protests, you’ll face new events that challenge your leadership and test your people. Certain governments and crises will award you with brand new ships that can’t be obtained through any other means. Your choices determine your path and what rewards and penalties you’ll have to deal with, so choose wisely.",
  "status": "ACTIVE",
  "productSlug": null,
  "urlSlug": "galactic-civilizations-iii--intrigue-expansion",
  "creationDate": "2020-12-09T08:16:29.847Z",
  "lastModifiedDate": "2021-01-24T22:08:48.557Z",
  "effectiveDate": "2021-01-21T16:00:00.000Z",
  "viewableDate": null,
  "developer": null,
  "seller": {
    "id": "o-l69v3ppj5zgdpwtuvq6sgjew5yjt5w",
    "name": "Stardock Entertainment, Inc"
  },
  "linkedOfferId": null,
  "isFeatured": false,
  "ignoreOrder": false,
  "freeDays": 0,
  "collectionOfferIds": [],
  "technicalDetails": null,
  "recurrence": "ONCE",
  "categories": [
    {
      "path": "addons"
    },
    {
      "path": "addons/durable"
    },
    {
      "path": "applications"
    }
  ],
  "tags": [
    {
      "id": "9547",
      "name": "Windows",
      "namespace": "epic",
      "aliases": [],
      "operator": null,
      "created": "2019-10-11T02:43:18.435Z",
      "updated": "2023-01-15T00:00:17.241Z",
      "status": "ACTIVE",
      "referenceCount": 7646,
      "comment": null
    }
  ],
  "customAttributes": [
    {
      "key": "publisherName",
      "value": "Stardock Entertainment"
    },
    {
      "key": "developerName",
      "value": "Stardock Entertainment"
    }
  ],
  "keyImages": [
    {
      "type": "OfferImageWide",
      "url": "https://cdn1.epicgames.com/3c52fbac843d4375803187739db84801/offer/intrigue wide-2560x1440-f8433110811224d394770e56122e4bfa.jpeg",
      "md5": "f8433110811224d394770e56122e4bfa",
      "size": 755933,
      "uploadedDate": "2021-01-04T22:53:40.394Z",
      "width": 2560,
      "height": 1440
    },
    {
      "type": "OfferImageTall",
      "url": "https://cdn1.epicgames.com/3c52fbac843d4375803187739db84801/offer/intrigue tall-1200x1600-505674c3037d63d3ffffa6e390076764.jpeg",
      "md5": "505674c3037d63d3ffffa6e390076764",
      "size": 441601,
      "uploadedDate": "2021-01-04T22:53:56.668Z",
      "width": 1200,
      "height": 1600
    },
    {
      "type": "Thumbnail",
      "url": "https://cdn1.epicgames.com/3c52fbac843d4375803187739db84801/offer/intrigue tall-1200x1600-505674c3037d63d3ffffa6e390076764.jpeg",
      "md5": "505674c3037d63d3ffffa6e390076764",
      "size": 441601,
      "uploadedDate": "2021-01-04T22:54:11.642Z",
      "width": 1200,
      "height": 1600
    },
    {
      "type": "CodeRedemption_340x440",
      "url": "https://cdn1.epicgames.com/3c52fbac843d4375803187739db84801/offer/intrigue tall-1200x1600-505674c3037d63d3ffffa6e390076764.jpeg",
      "md5": "505674c3037d63d3ffffa6e390076764",
      "size": 441601,
      "uploadedDate": "2021-01-04T22:54:22.443Z",
      "width": 1200,
      "height": 1600
    },
    {
      "type": "DieselStoreFrontWide",
      "url": "https://cdn1.epicgames.com/3c52fbac843d4375803187739db84801/offer/intrigue wide-2560x1440-f8433110811224d394770e56122e4bfa.jpeg",
      "md5": "f8433110811224d394770e56122e4bfa",
      "size": 755933,
      "uploadedDate": "2021-01-04T22:54:34.127Z",
      "width": 2560,
      "height": 1440
    },
    {
      "type": "DieselStoreFrontTall",
      "url": "https://cdn1.epicgames.com/3c52fbac843d4375803187739db84801/offer/intrigue tall-1200x1600-505674c3037d63d3ffffa6e390076764.jpeg",
      "md5": "505674c3037d63d3ffffa6e390076764",
      "size": 441601,
      "uploadedDate": "2021-01-04T22:54:44.771Z",
      "width": 1200,
      "height": 1600
    }
  ],
  "items": [
    {
      "id": "8d78977d97b549ed860ac3f82a393334"
    }
  ],
  "catalogNs": {
    "name": "3c52fbac843d4375803187739db84801"
  }
}