{
  "id": "dd496cb979c3491abd4342c424f87749",
  "namespace": "b45f4ea9d6ca4644a06b5f52ee87930e",
  "title": "Realife Simulator",
  "description": "Rent a car, customize your character and start touring the city. Get ready to explore the open world of Realife Simulator.",
  "longDescription": "<!--textBlock-->\n<!--title-->\n# Real Life Simulator will be a Simulation and Role Playing game.\n<!--text-->\nRent a car, customize your character and start touring the city. Get ready to explore the open world of Realife Simulator.\n\nReal Life Simulator will be a Simulation and Role Playing game. You can come out of the real world and shape your character's life in an imaginary world.\nWhat You Can Do In the Game?\n\nWhen you first start Real Life Simulator, you will have a $ 500 financial resource as an ordinary citizen. You can use your money the way you want it. You can buy yourself an outfit, rent a house, buy a car or throw it at the bank and fold your money with interest.\nIn the game you will be able to do many professions.\n\nFor example, as a policeman, he could pursue crimes in the city. You can bring the criminals to justice.\n\nYou can provide justice as a judge. As a health worker, you can help the players who need help.\n\nAs a lawyer, he can take cases for money. As you solve your cases, you can progress in your career.\n\nAs a taxi driver, you can earn money from your customers by taking them to the place they want to catch on the road.\n\nOr you can kill a man as a criminal. Remember that when you commit a crime, the police of real players may come after you. When you are caught, you will be brought before a judge. During the court stage, you can hire a lawyer who is a lawyer, and you can reduce your penalties to a minimum.\n\nIf you get a penalty, you will be suspended from the game for the duration of the penalty.\nImportant Detail!\nThere will be no Artificial Intelligence Players referred to as NPC in any way in the game.\nWhat you can do in the game will be limited to your imagination.\n\nWhat we think to offer in the Closed Beta Process.\n\n\nCareer System\n\n(Policing, Judge, Attorney, Taxi driver, Bus driver, Health Care)\nPurchasing System\n\n(Home Rental, Home Buying, Buying Food and Drink, Buying Household Goods, Buying Clothes, Buying a Car, Buying Weapons)\nPresidential System\n\n(Presidency During the Beta Process - City Control will be in the hands of the Managers.)\nPlayer Owned Businesses\nPlayer Owned Businesses - Throughout the city there are player run businesses, from night clubs, to food venues and even car sales. Whatever takes your fancy there will be something you can do that will help you bring in that safe cash!\nDialogue System\n\n(You can shape the houses you have purchased or rented the way you want.\nYou can shape your characters' clothes and look as you like)\nJudge System:\n\nJudge System: As a Judge, you will be faced with the crime in the city and will be caught by the police and will be the people. The punishments you will give according to their crimes will be up to you. (Judges will be composed of Moderators and Administrators.)\nAttorney System:\n\nPersons who have committed a crime will be able to defend themselves in court against judges by purchasing a lawyer from among other actors.\nBus Driver\n\nBus Driver - A convenient solo job that has the chance of players hopping on to get around, as well as locals needing to get from place to place. This is a great job for cruising around, learning the city and potentially meeting new friends!\nTaxi Driver\nTaxi - Is another convenient solo job that has the player exploring the map and taking customers from their A>B, driving like a maniac is not encouraged as the customers get quite upset! Not as upset as you will be when you leave the family dog behind and it chases you down the street…\n\n(We will be able to create a place of competition in the spaces by creating various fighting places.)\n\nSome Fighting Competitions You're Thinking About:\nBoxing Competitions:\n(In addition, Monthly Championship Competitions will be organized. Required Degree Game Game Participation will be able to.)\nTraining Areas - Gyms\n\n(Training areas where you can work out before a fight, Gyms for Improving Yourself)\nCooking Job\nWithin the Sk8 place where players can kick back and have some fun, there are 3 positions available for anyone to take up, you can cook some great food, cash in the daily profits or advertise as the mascot, needless to say at the end of a day you’ll be rolling in it!\n\n\n\nSun Real State is the go to team for anything housing related, with a group of well rounded staff that compliment each others strengths. Dedicated to our customer service we highlight and focus our efforts into ensuring a happy customer rather than caring about money and profit. Our goal is to have a roof over every citizens head and one that you’d be proud of owning.\n\nAt A9 we offer something rarely seen anywhere else, the ability to customize your own interior! Start out with a blank shell, downsize an old home, upsize to a bigger home or even just renovate an existing home and flip it for profit. With 30+ interior shells and 1000+ items buyable for your interior you can really make your home the way YOU want!\n\nIf you aren’t interested in the efforts of designing your own home, we also offer MLO buildings where you can walk up, unlock your front door and straight inside.\n\n\n\nOur CPDS is highly focused on making great roleplay a priority, we prefer our officers to be relaxed and fun to be around, worrying less about perfection but making the situation enjoyable for all. To me I think this makes the New Chance CPDS a unique place to be, a department that’s striving for a crime free city, whilst liaising with multiple departments forming one big team.\n\nWe highly encourage anyone who has an interest in roleplaying as an officer to join the CPDS, as my good friend Vin Diesel would say… “It’s all about family”. You’ll have great fun, create awesome stories and help us continue our legacy of being a unique police department. So whether you’re experienced or inexperienced, if your passion fits everything above, come apply for the New Chance CPDS.\n\n\nNot everything is about work and play, we also realize the importance of features that bring a good quality of life, features that allow you to put your mark within the world and ways to show off your wealth, see below a few of the notable amenities that’ll just make your life on the server.\n\nFood & Drink - You will need to keep yourself topped up with snacks and making sure you’re drowning in drinks! Don’t worry though, you won’t start dying of starvation or dehydration… however! You may find yourself tripping over your feet a little as exhaustion sets in!\n\nHotels / Motels / Housing - Having a place to call home is important, somewhere safe you can keep your belongings and take a well needed rest. From buying your dream home with Sun Real State , rent all the way to renting a hotel or motel room, there is hundreds of places for you to make your hobbit hole!\n\nShareable Banking - Maybe you’re a married couple, close friends or extremely relaxed with your money? New Chance offers a banking system that allows you to share your account, rightfully at your own risk, but there is a great banking system in place to track where those silly spends go!\n\nRacing System & Custom Realistic Handling - For those car fanatics who love expressing themselves through rubber and metal, there is multitudes of cars available for you to purchase and customize. But it doesn’t stop there! Take those cars and set time trial laps, or grand prix style races through the inner city racing systems!\n\n| Multiple Characters - Creativity is only limited to what you can create, with multiple characters available you can be a crime lord at night and an EMT by day! Just don’t get the lives mixed together, each character lives a separate life and skipping this fact will get you in trouble!\n\n| Boats & Plane ownership - Not many cities offer players the possibility to own planes & boats, well we like to be different. Obviously use them with caution, but enjoy yourself the city looks great from the air and the ocean is such a calming place!\n\n\nAt CMDAS we are more than just a government job, internally we help our employees be the best they can be helping them grow and progress. Externally we help our citizens with health related needs as well as donating to fundraisers, hosting fundraisers and giving back to the city.\n\nAt CMDAS you’ll meet people from all different walks of life, we don’t discriminate within this job so professionalism is a high standard, from treating the worst of the worst to our brothers and sisters in the police departments, this job will bring out the best in yourself and your peers.\n\nWe are looking for fun-loving, patient and level-headed people who really value teamwork, experience is always preferred but not required. All of our trainers will support you and give you the tools required to be an outstanding EMT, if you strive for growth we have plenty of opportunities to provide hard working individuals and a competitive salary.\n\n\nAt CS we are here to fight for Justice! Everyone within the CS team is 100% invested in any case that comes their way, no matter who you are, everyone gets treated equally with equal chances to make your case.\n\nWe have a great team who are extremely helpful from day 1, you’ll get all the proper training and support to ensure you become a great Lawyer. No previous knowledge is required so it may seem daunting at first, but with patience and understanding we know that mistakes make people stronger and better willed at doing right.\n",
  "status": "ACTIVE",
  "productSlug": null,
  "urlSlug": "b07532f41a554600862f9751c4f2a0f9",
  "creationDate": "2023-10-05T21:21:14.193Z",
  "lastModifiedDate": "2025-03-26T23:03:34.149Z",
  "effectiveDate": "2024-12-14T19:00:01.000Z",
  "viewableDate": "2024-01-15T06:31:25.247Z",
  "developer": null,
  "seller": {
    "id": "o-szmctjya45k3aj4s49czugwkzv74s8",
    "name": "Northenlight Studios"
  },
  "linkedOfferId": null,
  "isFeatured": false,
  "ignoreOrder": false,
  "freeDays": 0,
  "collectionOfferIds": [],
  "technicalDetails": null,
  "recurrence": "ONCE",
  "categories": [
    {
      "path": "games/edition/base"
    },
    {
      "path": "games/edition"
    },
    {
      "path": "games"
    }
  ],
  "tags": [
    {
      "id": "1216",
      "name": "Action",
      "namespace": null,
      "aliases": [],
      "operator": null,
      "created": "2019-06-20T12:00:05.613Z",
      "updated": "2025-06-25T02:49:31.883Z",
      "status": "ACTIVE",
      "referenceCount": 4190,
      "comment": null
    },
    {
      "id": "1393",
      "name": "Simulation",
      "namespace": null,
      "aliases": [],
      "operator": null,
      "created": "2019-06-20T12:01:33.848Z",
      "updated": "2025-06-25T02:49:36.519Z",
      "status": "ACTIVE",
      "referenceCount": 2138,
      "comment": null
    },
    {
      "id": "1370",
      "name": "Single Player",
      "namespace": null,
      "aliases": [],
      "operator": null,
      "created": "2019-06-20T12:01:22.169Z",
      "updated": "2025-06-25T08:25:48.234Z",
      "status": "ACTIVE",
      "referenceCount": 11180,
      "comment": null
    },
    {
      "id": "9547",
      "name": "Windows",
      "namespace": null,
      "aliases": [],
      "operator": null,
      "created": "2019-10-11T02:43:18.435Z",
      "updated": "2025-06-25T08:35:20.218Z",
      "status": "ACTIVE",
      "referenceCount": 20067,
      "comment": null
    },
    {
      "id": "1307",
      "name": "Open World",
      "namespace": null,
      "aliases": [],
      "operator": null,
      "created": "2019-06-20T12:00:51.191Z",
      "updated": "2025-06-25T02:49:34.453Z",
      "status": "ACTIVE",
      "referenceCount": 825,
      "comment": null
    },
    {
      "id": "1310",
      "name": "EARLY ACCESS",
      "namespace": "epic",
      "aliases": null,
      "operator": null,
      "created": "2019-06-20T12:00:52.671Z",
      "updated": "2023-08-22T22:50:29.701Z",
      "status": "ACTIVE",
      "referenceCount": 250,
      "comment": null
    }
  ],
  "customAttributes": [
    {
      "key": "autoGeneratedPrice",
      "value": "false"
    },
    {
      "key": "isManuallySetViewableDate",
      "value": "true"
    },
    {
      "key": "isPromotionalContentUsed",
      "value": "false"
    },
    {
      "key": "isManuallySetPCReleaseDate",
      "value": "false"
    },
    {
      "key": "isBlockchainUsed",
      "value": "false"
    }
  ],
  "keyImages": [
    {
      "type": "OfferImageWide",
      "url": "https://cdn1.epicgames.com/spt-assets/209d0bd3bc5442c999d9cc8d91f26243/realife-simulator-1qfg5.jpg",
      "md5": "74bcef1e0eb93c41ccaa4573fda66b33",
      "size": 201709,
      "uploadedDate": "2024-11-01T05:27:20.734Z",
      "width": 2560,
      "height": 1440
    },
    {
      "type": "OfferImageTall",
      "url": "https://cdn1.epicgames.com/spt-assets/209d0bd3bc5442c999d9cc8d91f26243/realife-simulator-psx93.jpg",
      "md5": "1abd3e5c81703cc0ceaa098749bb6eff",
      "size": 278843,
      "uploadedDate": "2024-11-30T19:12:37.372Z",
      "width": 1200,
      "height": 1600
    },
    {
      "type": "Thumbnail",
      "url": "https://cdn1.epicgames.com/spt-assets/209d0bd3bc5442c999d9cc8d91f26243/realife-simulator-psx93.jpg",
      "md5": "1abd3e5c81703cc0ceaa098749bb6eff",
      "size": 278843,
      "uploadedDate": "2024-11-30T19:12:37.372Z",
      "width": 1200,
      "height": 1600
    },
    {
      "type": "featuredMedia",
      "url": "https://cdn1.epicgames.com/spt-assets/209d0bd3bc5442c999d9cc8d91f26243/realife-simulator-jat3s.png",
      "md5": "098f6bcd4621d373cade4e832627b4f6",
      "size": 1972250,
      "uploadedDate": "2024-11-01T13:23:11.626Z",
      "width": 1920,
      "height": 1080
    },
    {
      "type": "featuredMedia",
      "url": "https://cdn1.epicgames.com/spt-assets/209d0bd3bc5442c999d9cc8d91f26243/realife-simulator-jol8j.png",
      "md5": "098f6bcd4621d373cade4e832627b4f6",
      "size": 2090590,
      "uploadedDate": "2024-11-01T13:24:08.004Z",
      "width": 1920,
      "height": 1080
    },
    {
      "type": "featuredMedia",
      "url": "https://cdn1.epicgames.com/spt-assets/209d0bd3bc5442c999d9cc8d91f26243/realife-simulator-1lenc.png",
      "md5": "098f6bcd4621d373cade4e832627b4f6",
      "size": 861523,
      "uploadedDate": "2024-11-01T13:24:42.237Z",
      "width": 1920,
      "height": 1080
    },
    {
      "type": "featuredMedia",
      "url": "https://cdn1.epicgames.com/spt-assets/209d0bd3bc5442c999d9cc8d91f26243/realife-simulator-aspii.png",
      "md5": "098f6bcd4621d373cade4e832627b4f6",
      "size": 2162784,
      "uploadedDate": "2024-11-01T13:24:49.820Z",
      "width": 1920,
      "height": 1080
    },
    {
      "type": "featuredMedia",
      "url": "https://cdn1.epicgames.com/spt-assets/209d0bd3bc5442c999d9cc8d91f26243/realife-simulator-19rfe.jpg",
      "md5": "098f6bcd4621d373cade4e832627b4f6",
      "size": 95154,
      "uploadedDate": "2024-11-01T13:25:33.617Z",
      "width": 1920,
      "height": 1080
    },
    {
      "type": "featuredMedia",
      "url": "https://cdn1.epicgames.com/spt-assets/209d0bd3bc5442c999d9cc8d91f26243/realife-simulator-arh14.png",
      "md5": "098f6bcd4621d373cade4e832627b4f6",
      "size": 2314718,
      "uploadedDate": "2024-11-01T13:26:46.183Z",
      "width": 1920,
      "height": 1080
    },
    {
      "type": "featuredMedia",
      "url": "https://cdn1.epicgames.com/spt-assets/209d0bd3bc5442c999d9cc8d91f26243/realife-simulator-1oow8.png",
      "md5": "098f6bcd4621d373cade4e832627b4f6",
      "size": 3289397,
      "uploadedDate": "2024-11-01T13:27:36.650Z",
      "width": 1920,
      "height": 1080
    },
    {
      "type": "featuredMedia",
      "url": "https://cdn1.epicgames.com/spt-assets/209d0bd3bc5442c999d9cc8d91f26243/realife-simulator-1rxlb.png",
      "md5": "098f6bcd4621d373cade4e832627b4f6",
      "size": 2993703,
      "uploadedDate": "2024-11-01T13:29:26.865Z",
      "width": 1920,
      "height": 1080
    }
  ],
  "items": [
    {
      "id": "076c8cf65e024e8d89e98f83ff5e3852"
    }
  ],
  "catalogNs": {
    "name": "b45f4ea9d6ca4644a06b5f52ee87930e"
  }
}