{
  "id": "e3419c532d174e93a931889a73cb03f5",
  "namespace": "dda64c2956b54f1ba3cd97f6aaee775f",
  "title": "Total War: WARHAMMER III - Shadows of Change",
  "description": "The Shadows of Change pack introduces 3 new Legendary Lords for Tzeentch, Grand Cathay, and Kislev, usable in both the Realm of Chaos and Immortal Empires campaigns. ",
  "longDescription": "​Inject new Legendary Lords, Heroes, and Units into your games to vastly expand your methods of play on the campaign map and within battles. The Changeling, Yuan Bo, and Mother Ostankya each bring their own unique campaign mechanics to their faction, with goals separate from the Realm of Chaos campaign, and new units to help them pursue victory on their terms.\n\n• 3 new Legendary Lords emerge from the shadows. \n\n• Enact malign schemes and trickery with the Changeling of Tzeentch. \n\n• Establish and execute grand stratagems on a global scale as Yuan Bo of Grand Cathay. \n\n• Conjure powerful hexes and incantations whilst engaging in witchcraft, flipping campaigns on their head as Mother Ostankya of Kislev.  \n\n• Embrace change with 3 new Legendary Heroes. Scatter magical spells at random with the Blue Scribes of Tzeentch, field Tzarina’s boldest champion with the Golden Knight of Kislev, Naryska Leysa, and strike from afar with the Sentinel of the Heavens, Saytang the Watcher, for Grand Cathay. \n\n​​• ​Enact unsettling rituals with the Lore of the Hag; a new spell lore for Mother Ostankya and Kislev.\n\n​​• ​Expand your rosters with 16 additional units, enhance your troops with 9 Regiments of Renown, and bolster your leadership with a new Lord and Hero for all 3 races.\n\n# SHADOWS OF CHANGE \n\n# TZEENTCH\n\nI make my home in the darkest pits of your soul. In the shadows, I bide my time. \n\n# THE CHANGELING \n\nAs the shape-shifting agent of misrule, the Changeling embodies the Changer of Ways’ most deceiving and manipulative tendencies. Able to take the form of any legendary character from the noble to the fearsome, none, save perhaps Tzeentch himself, know the Changeling's true form. His trickery may even deceive the Dark Gods themselves, able to mirror foes, create false allies, and disrupt empires from within, with only one truth becoming clear long after he’s enacted his handiwork. \n\nThe perplexing prankster of the known world, the Changeling of Tzeentch, was here. \n\nAs a spellcasting shapeshifter bolstering the Lore of Tzeentch, the Changeling can adopt the form of any lord he faces, making his battle efficiency grow stronger as your enemy tries to do the same. When not fighting directly, he lingers in the shadows, stalking his prey, and waiting for the optimal time to strike. \n\nTrust no one. \n\n# SCHEMES AND TRICKERY \n\nThe Changeling’s inscrutable and deceiving nature is the perfect recipe for schemes and trickery. For the Changeling, the world is divided into Theatres; segmented regions that contain Schemes, both minor and pivotal. Fuelled by an unending legion of tricksy cultists, to achieve his goals he must first break a Theatre down through smaller, cheekier Schemes by constructing buildings, stealing identities, and instigating tensions amongst otherwise civilized populations, culminating in a Grand Scheme and an epic battle for supremacy, rife with bountiful rewards along the way. \n\nGold, Grimoires, and Rifts aplenty.  \n\nWith enough Grand Schemes carried out, the Changeling’s final purpose is within reach: conducting the Ultimate Scheme for campaign victory.  \n\n# THE BLUE SCRIBES \n\nThis troublesome Legendary Hero, the Blue Scribes, ride atop their Disc of Tzeentch, scribbling on parchment as they go, and are capable of spewing all manner of spells across the battlefield by verbalising their scrolls. If only they knew what those words meant... \n\n# GRAND CATHAY \n\nThose in other nations may deny it, but all mortals desire control. To be controlled, that is.\n\n# YUAN BO, THE JADE DRAGON \n\nRuling over the Central Provinces of Cathay, Yuan Bo, the Jade Dragon leads the Court of Celestial Sorcerers. A bureaucrat of the highest order on the surface, yes, but a talented spymaster at heart, the Jade Dragon runs the city of Wei-jin and, by extension, is an administrator for the Cathay empire. Liked by his siblings, the good of Grand Cathay is in capable hands.  \n\nServing two roles between his human and dragon forms, the Jade Dragon can be a devastating single target destroyer, and a potent spellcaster with the Light, Yin, and Heaven lores of magic. Soar above the battlefield as a dragon, burning down even the strongest of enemy units, or take the fight on the ground with game-changing spells at your side. \n\nCathay stands, all the same.  \n\n# CONTROL THE STATE \n\nEngage in a chess match unlike any other with the Matters of State. As a master statesman, a right hand to the emperor and a spymaster, Yuan Bo’s influence over the kingdom runs deep. With this power, enact overt and covert policies across settlements, armies and even characters to best suit your empire’s needs. Crack down on settlement corruption, rush construction for your entire empire in a single move, create diplomatic deadlocks to move freely through unfriendly territories, and much, much more. \n\nGo beyond mere balance and embrace disharmony, leveraging it as an excuse to serve more severe and extreme actions to fit your agenda, and plan chains of actions to ensure the balance of harmony is pulled back in your favour when all is said and done.  \n\nYuan Bo doesn’t follow the rules. He writes them. \n\n# EMPOWER THE COMPASS \n\nWith a plan centuries in the making under the request of Yuan Bo’s father, the Jade Dragon is tasked with travelling to critical locations and constructing relays to empower the Jade Compass, before defending them from the Lizardmen incursions trying to dismantle Cathay. \n\nDestroy them, and plot a course to victory.  \n\n# KISLEV \n\nFor years we thought she was a child's tale to frighten us into behaving. Then one day, in my twentieth winter, I got too close to the woods. And when I was told Mother Ostankya would get you... I knew if I took one step closer to the trees it would be true. \n\n# MOTHER OSTANKYA \n\nTales of monsters and bogeymen have haunted many lands for centuries, but the tale hanging above the Kislevite children, a reminder of the consequences for displaying disobedience, was not just a tale. Mother Ostankya is real. A guardian, faithful to the land, holding anyone who seeks to harm it accountable, she draws her power from the very woods, fens and oblasts that she protects. When war comes to her door, she’ll be on the front lines, protecting the warriors of Kislev, and inflicting her terror upon any who oppose them. \n\nAnd if you cross her path, make no mistake. Mother Ostankya will punish you. \n\nAs a powerful sorceress with a bespoke melee component, Mother Ostankya utilises her cauldron on and off the battlefield, able to rain spirits down upon her foes from afar or sprout the legs of a spider in melee combat as an artillery-chariot hybrid.  \n\n# THE WITCH’S HUT \n\nThe Daughters of the Forest must infuse Mother Ostankya’s Witchcraft at the Witch’s Hut. With a new rare resource, Spirit Essence, you can take advantage of ingredients gathered during your playthrough to create potent Incantations and utilise Hexes to vastly change the course of your entire campaign.  \n\nForce enemy armies from your lands in an instant, purge entire provinces of corruption in a single move, buff your units far beyond their given capability, and unleash the full might of the witch as you search for the Malediction of Ruin; Mother Ostankya’s final Hex to secure the sanctity of Kislevite land. \n\n# NEW UNITS\n\nWelcome a world of change with new additional units for Tzeentch, Grand Cathay, and Kislev. \n\nField an abomination with the Mutalith Vortex Beast for Tzeentch, a horrific fusion of monster and magic, created by the powers of Chaos beyond any justifiable reason. It brings raw, magical destruction to the table with violent spectacle. \n\nIt won’t take a compass to find the new additions to the Cathayan roster. \n\nCrafted by the wizards of the Celestial Court, Guardian Lions are living statues made from Jet or Jade. For those seeking a magical touch, the Jade Lion is a conduit of sorcery, ​​able to use spells bound to its body and launch flaming attacks. The Jet Lion, however, is the opposite, countering magical spells to diminish any sorcery that may harm themselves or those nearby. \n\nPlus, new Kislevite units lurk in these woods. \n\nA terrible and frightening creature, known to many as The Thing in the Woods, brings its enormous size and infantry sundering capability to the frontlines of Kislev. Left unchecked, this beast will tear through enemy troops like paper, before rushing into the woods for cover and emerging to do it all over again.  \n\nAnd, of course, further horrors await within the Shadows of Change.\n\n\n\n",
  "status": "ACTIVE",
  "productSlug": null,
  "urlSlug": "total-war-warhammer-3--shadows-of-change",
  "creationDate": "2023-07-27T18:54:04.012Z",
  "lastModifiedDate": "2024-07-16T15:39:57.548Z",
  "effectiveDate": "2023-08-31T14:00:00.000Z",
  "viewableDate": "2023-08-31T14:00:00.000Z",
  "developer": null,
  "seller": {
    "id": "o-q3zwbk8kbbbgar9ql3x7d43rjj8bjl",
    "name": "SEGA of Europe"
  },
  "linkedOfferId": null,
  "isFeatured": false,
  "ignoreOrder": false,
  "freeDays": 0,
  "collectionOfferIds": [],
  "technicalDetails": null,
  "recurrence": "ONCE",
  "categories": [
    {
      "path": "addons"
    },
    {
      "path": "addons/durable"
    },
    {
      "path": "applications"
    }
  ],
  "tags": [
    {
      "id": "16979",
      "name": "Summer Sale",
      "namespace": null,
      "aliases": [],
      "operator": null,
      "created": "2021-07-14T15:58:17.560Z",
      "updated": "2024-07-18T15:00:10.854Z",
      "status": "ACTIVE",
      "referenceCount": 3078,
      "comment": ""
    }
  ],
  "customAttributes": [],
  "keyImages": [
    {
      "type": "OfferImageTall",
      "url": "https://cdn1.epicgames.com/offer/dda64c2956b54f1ba3cd97f6aaee775f/EGS_TotalWarWARHAMMERIIIShadowsofChange_CreativeAssembly_DLC_S2_1200x1600-32d4a1a7bf785c9d2d601e199c3672e6",
      "md5": "32d4a1a7bf785c9d2d601e199c3672e6",
      "size": 593280,
      "uploadedDate": "2023-07-27T18:13:07.969Z",
      "width": 1200,
      "height": 1600
    },
    {
      "type": "OfferImageWide",
      "url": "https://cdn1.epicgames.com/offer/dda64c2956b54f1ba3cd97f6aaee775f/EGS_TotalWarWARHAMMERIIIShadowsofChange_CreativeAssembly_DLC_S1_2560x1440-d0d04fd0873124ab9ed3bafc1e778259",
      "md5": "d0d04fd0873124ab9ed3bafc1e778259",
      "size": 997432,
      "uploadedDate": "2023-07-27T18:13:10.812Z",
      "width": 2560,
      "height": 1440
    },
    {
      "type": "ProductLogo",
      "url": "https://cdn1.epicgames.com/offer/dda64c2956b54f1ba3cd97f6aaee775f/EGS_TotalWarWARHAMMERIIIShadowsofChange_CreativeAssembly_DLC_IC1_200x200-8d079cd04ab61e29941cf3c080216689",
      "md5": "8d079cd04ab61e29941cf3c080216689",
      "size": 49551,
      "uploadedDate": "2023-07-27T18:13:25.629Z",
      "width": 200,
      "height": 200
    },
    {
      "type": "Thumbnail",
      "url": "https://cdn1.epicgames.com/offer/dda64c2956b54f1ba3cd97f6aaee775f/EGS_TotalWarWARHAMMERIIIShadowsofChange_CreativeAssembly_DLC_S2_1200x1600-32d4a1a7bf785c9d2d601e199c3672e6",
      "md5": "32d4a1a7bf785c9d2d601e199c3672e6",
      "size": 593280,
      "uploadedDate": "2023-07-27T18:13:13.254Z",
      "width": 1200,
      "height": 1600
    },
    {
      "type": "featuredMedia",
      "url": "https://cdn1.epicgames.com/offer/dda64c2956b54f1ba3cd97f6aaee775f/EGS_TotalWarWARHAMMERIIIShadowsofChange_CreativeAssembly_DLC_G1A_01_1920x1080-46b0b621d61f88d3abc4bb116f917b1b",
      "md5": "46b0b621d61f88d3abc4bb116f917b1b",
      "size": 663102,
      "uploadedDate": "2024-02-13T16:30:19.234Z",
      "width": 1920,
      "height": 1080
    },
    {
      "type": "featuredMedia",
      "url": "https://cdn1.epicgames.com/offer/dda64c2956b54f1ba3cd97f6aaee775f/EGS_TotalWarWARHAMMERIIIShadowsofChange_CreativeAssembly_DLC_G1A_02_1920x1080-ea65efdd8cca3a455bf171116b3728c8",
      "md5": "ea65efdd8cca3a455bf171116b3728c8",
      "size": 250843,
      "uploadedDate": "2024-02-13T16:30:21.853Z",
      "width": 1920,
      "height": 1080
    },
    {
      "type": "featuredMedia",
      "url": "https://cdn1.epicgames.com/offer/dda64c2956b54f1ba3cd97f6aaee775f/EGS_TotalWarWARHAMMERIIIShadowsofChange_CreativeAssembly_DLC_G1A_03_1920x1080-c282e545d9ddea3b1d96304cbe4a9c64",
      "md5": "c282e545d9ddea3b1d96304cbe4a9c64",
      "size": 464482,
      "uploadedDate": "2024-02-13T16:30:24.664Z",
      "width": 1920,
      "height": 1080
    },
    {
      "type": "featuredMedia",
      "url": "https://cdn1.epicgames.com/offer/dda64c2956b54f1ba3cd97f6aaee775f/EGS_TotalWarWARHAMMERIIIShadowsofChange_CreativeAssembly_DLC_G1A_04_1920x1080-747c8907f66669fb6594f8aa1dcb97dd",
      "md5": "747c8907f66669fb6594f8aa1dcb97dd",
      "size": 244979,
      "uploadedDate": "2024-02-13T16:30:38.375Z",
      "width": 1920,
      "height": 1080
    },
    {
      "type": "featuredMedia",
      "url": "https://cdn1.epicgames.com/offer/dda64c2956b54f1ba3cd97f6aaee775f/EGS_TotalWarWARHAMMERIIIShadowsofChange_CreativeAssembly_DLC_G1A_05_1920x1080-a10c65a06909b52865cb743226f153bd",
      "md5": "a10c65a06909b52865cb743226f153bd",
      "size": 336581,
      "uploadedDate": "2024-02-13T16:30:41.639Z",
      "width": 1920,
      "height": 1080
    },
    {
      "type": "featuredMedia",
      "url": "https://cdn1.epicgames.com/offer/dda64c2956b54f1ba3cd97f6aaee775f/EGS_TotalWarWARHAMMERIIIShadowsofChange_CreativeAssembly_DLC_G1A_06_1920x1080-18a1a979f7010ca349df23b4bd1f618a",
      "md5": "18a1a979f7010ca349df23b4bd1f618a",
      "size": 410187,
      "uploadedDate": "2024-02-13T16:30:56.768Z",
      "width": 1920,
      "height": 1080
    },
    {
      "type": "featuredMedia",
      "url": "https://cdn1.epicgames.com/offer/dda64c2956b54f1ba3cd97f6aaee775f/EGS_TotalWarWARHAMMERIIIShadowsofChange_CreativeAssembly_DLC_G1A_07_1920x1080-b863cba998db55e1ca0c40d58d67c74d",
      "md5": "b863cba998db55e1ca0c40d58d67c74d",
      "size": 496119,
      "uploadedDate": "2024-02-13T16:30:59.811Z",
      "width": 1920,
      "height": 1080
    },
    {
      "type": "featuredMedia",
      "url": "https://cdn1.epicgames.com/offer/dda64c2956b54f1ba3cd97f6aaee775f/EGS_TotalWarWARHAMMERIIIShadowsofChange_CreativeAssembly_DLC_G1A_08_1920x1080-83f58d5053a1b485f9d8d09625b6b0c7",
      "md5": "83f58d5053a1b485f9d8d09625b6b0c7",
      "size": 495972,
      "uploadedDate": "2024-02-13T16:31:02.966Z",
      "width": 1920,
      "height": 1080
    },
    {
      "type": "featuredMedia",
      "url": "https://cdn1.epicgames.com/offer/dda64c2956b54f1ba3cd97f6aaee775f/EGS_TotalWarWARHAMMERIIIShadowsofChange_CreativeAssembly_DLC_G1A_09_1920x1080-bc50824a40c50b630a2104826275c1be",
      "md5": "bc50824a40c50b630a2104826275c1be",
      "size": 554757,
      "uploadedDate": "2024-02-13T16:31:07.189Z",
      "width": 1920,
      "height": 1080
    },
    {
      "type": "featuredMedia",
      "url": "https://cdn1.epicgames.com/offer/dda64c2956b54f1ba3cd97f6aaee775f/EGS_TotalWarWARHAMMERIIIShadowsofChange_CreativeAssembly_DLC_G1A_10_1920x1080-9dab113f129ca9cf324a7bfe041db60a",
      "md5": "9dab113f129ca9cf324a7bfe041db60a",
      "size": 542818,
      "uploadedDate": "2024-02-13T16:31:11.317Z",
      "width": 1920,
      "height": 1080
    },
    {
      "type": "featuredMedia",
      "url": "https://cdn1.epicgames.com/offer/dda64c2956b54f1ba3cd97f6aaee775f/EGS_TotalWarWARHAMMERIIIShadowsofChange_CreativeAssembly_DLC_G1A_11_1920x1080-2f6fa702a3fd570c9b167c148b09956d",
      "md5": "2f6fa702a3fd570c9b167c148b09956d",
      "size": 814560,
      "uploadedDate": "2024-02-13T16:31:20.514Z",
      "width": 1920,
      "height": 1080
    }
  ],
  "items": [
    {
      "id": "6e22d1c5a4d24dc1bd1c9b5fd6b76838"
    }
  ],
  "catalogNs": {
    "name": "dda64c2956b54f1ba3cd97f6aaee775f"
  }
}