{
  "id": "f87a632ff7894815a35feabe579cf48b",
  "namespace": "f49b950ecea842f5a5ba4911a5f19bba",
  "title": "Quantum Command Closed Alpha",
  "description": "Travel through time to battle the Dark Prophets and protect Earth's history. Featuring AI-generated maps, and a play-to-earn model, players can earn rewards and unlock new eras as they fight to secure the future.\nTHIS IS A CLOSED ALPHA- YOU NEED A PASSCODE TO PLAY",
  "longDescription": "<!--textBlock-->\n<!--title-->\n# Join the epic battle across time in Quantum Command! Protect history, earn rewards, and become a legend in this web3 action game.\n<!--text-->\nEpic Time-Traveling Adventure\nStep into a world where history itself is at stake. In Quantum Command, you’ll travel through time to iconic eras, from the grandeur of ancient Rome to the futuristic cities of the 26th century. Each era presents unique challenges and enemies, making every mission a thrilling new experience. Your decisions will not only shape the battlefield but also the very course of history.\n\nDynamic AI-Generated Maps\nNo two battles are ever the same. Thanks to our cutting-edge AI, Quantum Command generates maps dynamically, offering endless possibilities and a fresh experience every time you play. Whether you’re navigating the narrow corridors of a dystopian megacity or the icy tunnels of an arctic base, you’ll need to adapt your strategy on the fly. Explore, adapt, and dominate in constantly evolving environments.\n\nIntense Combat Across Eras\nEngage in fast-paced, heart-pounding combat that challenges both your reflexes and tactical thinking. With a diverse arsenal of weapons at your disposal, from ancient blades to futuristic firearms, you’ll need to master both ranged and melee combat to overcome your enemies. Each era offers unique weapons and tools, allowing you to customize your approach and become a master of time.\n\nPlay-to-Earn with Tokens\nIn Quantum Command, your skills are rewarded. Our innovative play-to-earn model lets you earn Tokens through gameplay. Complete missions, defeat enemies, and achieve objectives to accumulate tokens that you can use to unlock new abilities, gear, and exclusive content. Plus, players who hold the NFT BOOST receive daily airdrops, giving you even more ways to enhance your in-game experience.\n\nNFT BOOST and Exclusive Rewards\nMaximize your rewards with the NFT BOOST, a powerful tool that grants you daily airdrops of Tokens. This exclusive feature not only boosts your earnings but also provides access to unique in-game content, special abilities, and rare items that set you apart on the battlefield. Hold the BOOST, and take your Quantum Command experience to the next level.\n\nRich Storyline and Immersive World\nQuantum Command isn’t just about combat—it’s about storytelling. Dive into a richly woven narrative where every mission has meaning, and every decision matters. As you battle the Dark Prophets, you’ll uncover the secrets of Adramalech and the true stakes behind the war across time. Immerse yourself in a world where lore and action go hand in hand.\n\nSingle Player Experience\n\nSince is a closed alpah, with reserved accesso to our testeres and baker community, in this version only the single player mode is enabled. But don't worry! You have two AI droid buddies that will help you to defeat the bosses!\n\nCross-Era Battles\nQuantum Command pushes the boundaries of tactical gameplay with its cross-era battles. Imagine leading a team where ancient warriors fight alongside futuristic soldiers, each using their unique skills to overcome impossible odds. This blending of eras creates unprecedented strategic depth, allowing for creative and unpredictable gameplay.\n\nStrategic Customization\nYour approach to battle is as unique as your playstyle. Quantum Command offers deep customization options, allowing you to tailor your loadout, choose your weapons, and equip powerful abilities that suit your strategy. Whether you’re a stealthy rogue, a tanky warrior, or a versatile jack-of-all-trades, you can build your character to fit the role you want to play.\n\nVisually Stunning Environments\nEvery era in Quantum Command is brought to life with stunning detail. From the sun-soaked ruins of ancient civilizations to the neon-lit streets of a cyberpunk future, each environment is designed to immerse you in the world and enhance your gameplay experience. The dynamic lighting, realistic weather effects, and intricate textures make every battle feel like a cinematic event.\n\nEndless Replayability\nWith AI-generated maps, a play-to-earn economy, and a constantly expanding universe, Quantum Command offers endless replayability. New content, events, and updates ensure that there’s always something new to discover, whether you’re hunting for rare items, competing in leaderboard challenges, or uncovering the deeper secrets of the game’s lore.\n\n\nRegular Updates and Expansions\nQuantum Command is a living game, constantly evolving with regular updates and expansions. New eras, missions, weapons, and storylines are regularly added to keep the game fresh and exciting. As you progress, you’ll always find new challenges and opportunities to test your skills.\n\nCompete for Glory\nWhether you’re climbing the ranks in competitive multiplayer or completing difficult missions for the highest rewards, Quantum Command offers plenty of ways to prove your skills. Achievements, leaderboards, and special events keep the competition fierce, and the rewards plentiful. Are you ready to rise to the top?\n\n\nQuantum Command is more than just a game, it's a gateway to adventure, competition, and discovery. With its dynamic gameplay, rich storyline, and innovative features, it offers something for every type of gamer. Whether you're looking to immerse yourself in a deep narrative, test your skills in intense combat, or earn real rewards through strategic play, Quantum Command delivers an experience that keeps you coming back for more. Join the fight, protect the timeline, and make your mark in the history of Quantum Command!\n\n<!--image-->\n![Quantum Command-1nmp2](https://cdn1.epicgames.com/spt-assets/b2f870e12f1a4712826a49d0ba1b8adc/quantum-command-1nmp2.png)\n",
  "status": "ACTIVE",
  "productSlug": null,
  "urlSlug": "alpha-test",
  "creationDate": "2025-04-09T12:10:10.535Z",
  "lastModifiedDate": "2025-06-16T14:55:21.695Z",
  "effectiveDate": "2025-06-16T23:00:00.000Z",
  "viewableDate": "2025-06-01T08:30:00.000Z",
  "developer": null,
  "seller": {
    "id": "o-849899929acay4496glxtm96t9eeyx",
    "name": "OMM Games"
  },
  "linkedOfferId": null,
  "isFeatured": false,
  "ignoreOrder": false,
  "freeDays": 0,
  "collectionOfferIds": [],
  "technicalDetails": null,
  "recurrence": "ONCE",
  "categories": [
    {
      "path": "spthidden"
    },
    {
      "path": "spthidden/demo"
    }
  ],
  "tags": [
    {
      "id": "1210",
      "name": "Shooter",
      "namespace": null,
      "aliases": [],
      "operator": null,
      "created": "2019-06-20T12:00:02.690Z",
      "updated": "2025-06-25T02:49:30.486Z",
      "status": "ACTIVE",
      "referenceCount": 1946,
      "comment": null
    },
    {
      "id": "1370",
      "name": "Single Player",
      "namespace": null,
      "aliases": [],
      "operator": null,
      "created": "2019-06-20T12:01:22.169Z",
      "updated": "2025-06-25T08:25:48.234Z",
      "status": "ACTIVE",
      "referenceCount": 11180,
      "comment": null
    },
    {
      "id": "9547",
      "name": "Windows",
      "namespace": null,
      "aliases": [],
      "operator": null,
      "created": "2019-10-11T02:43:18.435Z",
      "updated": "2025-06-25T08:35:20.218Z",
      "status": "ACTIVE",
      "referenceCount": 20050,
      "comment": null
    },
    {
      "id": "21739",
      "name": "NFT BLOCKCHAIN",
      "namespace": null,
      "aliases": [],
      "operator": null,
      "created": "2022-06-24T20:06:43.344Z",
      "updated": "2024-10-25T20:00:26.146Z",
      "status": "ACTIVE",
      "referenceCount": 292,
      "comment": ""
    }
  ],
  "customAttributes": [
    {
      "key": "autoGeneratedPrice",
      "value": "true"
    },
    {
      "key": "isManuallySetViewableDate",
      "value": "true"
    },
    {
      "key": "isPromotionalContentUsed",
      "value": "false"
    },
    {
      "key": "isManuallySetPCReleaseDate",
      "value": "false"
    },
    {
      "key": "isBlockchainUsed",
      "value": "true"
    }
  ],
  "keyImages": [
    {
      "type": "OfferImageWide",
      "url": "https://cdn1.epicgames.com/spt-assets/b2f870e12f1a4712826a49d0ba1b8adc/quantum-command-19y33.jpg",
      "md5": "f943d02eb82b4f4da40eba345eab5a30",
      "size": 680822,
      "uploadedDate": "2025-04-10T01:55:51.284Z",
      "width": 2560,
      "height": 1440
    },
    {
      "type": "OfferImageTall",
      "url": "https://cdn1.epicgames.com/spt-assets/b2f870e12f1a4712826a49d0ba1b8adc/quantum-command-6qy6c.jpg",
      "md5": "f08a054f1d5401fb5fff497a13247c65",
      "size": 447302,
      "uploadedDate": "2025-04-10T02:24:12.131Z",
      "width": 1200,
      "height": 1600
    },
    {
      "type": "Thumbnail",
      "url": "https://cdn1.epicgames.com/spt-assets/b2f870e12f1a4712826a49d0ba1b8adc/quantum-command-6qy6c.jpg",
      "md5": "f08a054f1d5401fb5fff497a13247c65",
      "size": 447302,
      "uploadedDate": "2025-04-10T02:24:12.131Z",
      "width": 1200,
      "height": 1600
    },
    {
      "type": "heroCarouselVideo",
      "url": "com.epicgames.video://a5c0a9d2-e886-46c1-84c2-dfc67f92f879?cover=https%3A%2F%2Fcdn1.epicgames.com%2Fspt-assets%2Fb2f870e12f1a4712826a49d0ba1b8adc%2Fquantum-command-video-15uol.png",
      "md5": "comepicgamesvideomd5hashconstant",
      "size": 260156374,
      "uploadedDate": "2025-04-09T21:14:55.205Z",
      "width": 1920,
      "height": 1080
    }
  ],
  "items": [
    {
      "id": "e985b8b19d2d4bb9b49d599cbe046af3"
    }
  ],
  "catalogNs": {
    "name": "f49b950ecea842f5a5ba4911a5f19bba"
  }
}